{"metadata":{"color":{"standardColorIdentifier":"purple"},"title":"Keeping Yourself Ready","platforms":[{"introducedAt":"2016.01.07","name":"Brunow"}],"modules":[{"name":"Brunow"}]},"sections":[],"identifier":{"url":"doc:\/\/Brunow\/documentation\/Brunow\/01-07-keeping-yourself-ready","interfaceLanguage":"swift"},"hierarchy":{"paths":[["doc:\/\/Brunow\/documentation\/Brunow","doc:\/\/Brunow\/documentation\/Brunow\/Archive","doc:\/\/Brunow\/documentation\/Brunow\/2016"]]},"kind":"article","primaryContentSections":[{"kind":"content","content":[{"inlineContent":[{"text":"Flexibility is a competitive advantage. If you can adapt to your environment faster than anyone else then you have the opportunity to get a disproportionate share of the benefits. For example, companies that were setup in such a way that they were able to make a quality app when Apple first introduced the App Store were able to benefit more than people getting into making apps after there were over a million apps in the App Store.","type":"text"}],"type":"paragraph"},{"type":"paragraph","inlineContent":[{"text":"I think there are two key components to ensuring you’ll be flexible.","type":"text"}]},{"inlineContent":[{"text":"First, you have to give yourself slack in your schedule. If you are working at 100% of your capacity then you have no flexibility to add something new. It also helps to have projects which you can deprioritize as business demands shift to something else. For example, we are working on a couple of internal apps that we think will be great but have no set timeline for completion.","type":"text"}],"type":"paragraph"},{"inlineContent":[{"text":"Second, you have to ensure your tools are always sharp. That can mean many things, but the essence of it is that if you need to do something right now to capitalize on an opportunity then you can’t spend days or weeks getting yourself ready. I’ll share an example.","type":"text"}],"type":"paragraph"},{"type":"paragraph","inlineContent":[{"type":"text","text":"I have an alarm clock app in the App Store. Before the music streaming service Rdio shut down, it was the only alarm clock that would allow you to wake up to your Rdio playlists (now it uses Apple Music instead.) I first created the app a few years ago before Apple released two devices with drastically different screen sizes. When they did that I didn’t have time to update the app to work on the new devices. Then about 6 months ago Rdio changed something that required my app to act differently. Since the app hadn’t been updated for the new phones I had to do a lot more work to fix that problem before I could fix the issue that Rdio caused. The outcome was that I didn’t hit Rdio’s deadline and had to pull the app from the store while I worked on it."}]},{"inlineContent":[{"text":"Don’t be that me that lets my apps get too out of date to remain flexible. Find any ways that you can remain as flexible as possible. You have no way of knowing the future on even the next project you’ll work on. Accept that reality and plan for it.","type":"text"}],"type":"paragraph"}]}],"variants":[{"paths":["\/documentation\/brunow\/01-07-keeping-yourself-ready"],"traits":[{"interfaceLanguage":"swift"}]}],"schemaVersion":{"minor":3,"major":0,"patch":0},"topicSectionsStyle":"detailedGrid","abstract":[{"text":"Flexibility is a competitive advantage.","type":"text"}],"references":{"doc://Brunow/documentation/Brunow/Archive":{"kind":"article","type":"topic","abstract":[{"type":"text","text":"All posts"}],"title":"Archive","identifier":"doc:\/\/Brunow\/documentation\/Brunow\/Archive","url":"\/documentation\/brunow\/archive","role":"collectionGroup"},"doc://Brunow/documentation/Brunow":{"url":"\/documentation\/brunow","abstract":[{"type":"text","text":"David Brunow, known as Brunow [ˈbɹunoʊ] to the folks he works with, is a human living on Earth. You might have something in common with him — if you think it is ridiculous that he is talking about himself in the first person here, so does he."}],"kind":"symbol","role":"collection","title":"Brunow","type":"topic","identifier":"doc:\/\/Brunow\/documentation\/Brunow"},"doc://Brunow/documentation/Brunow/2016":{"title":"2016","identifier":"doc:\/\/Brunow\/documentation\/Brunow\/2016","url":"\/documentation\/brunow\/2016","role":"collectionGroup","abstract":[],"type":"topic","kind":"article"}}}