{"hierarchy":{"paths":[["doc:\/\/Brunow\/documentation\/Brunow","doc:\/\/Brunow\/documentation\/Brunow\/Archive","doc:\/\/Brunow\/documentation\/Brunow\/2016"]]},"sections":[],"topicSectionsStyle":"detailedGrid","kind":"article","primaryContentSections":[{"content":[{"type":"paragraph","inlineContent":[{"text":"I talked with a smart guy I like and respect the other night. He is also a small business owner and he’s been doing it longer than we have. He’s a role model for us and proof that the community we live in values entrepreneurism. That’s all to say that when he gives advice it is a good idea for us to listen to it.","type":"text"}]},{"inlineContent":[{"type":"text","text":"One thing he said the other night — and really this is advice that’s been told many times by many people over many years — was not to give anything away for free. Once you do that you are devaluing yourself and you are highly unlikely to get anything from that person in the future."}],"type":"paragraph"},{"inlineContent":[{"type":"text","text":"I don’t think the advice can be that generic. I take things very literally so he may agree with what I’m going to say next. I believe there are times when it is good to give away something for free. It depends on the context of your situation, but I’ve come up with 4 scenarios that I’ve come across which mostly apply to our line of work, technology consulting:"}],"type":"paragraph"},{"type":"unorderedList","items":[{"content":[{"type":"paragraph","inlineContent":[{"text":"You need to learn something — The best way to learn anything is to do it on a real project. And it is easier to convince someone to let you do something for free and you’ll get educational value out of it. But you have to go in expecting that that person will never give you any money and be OK with that.","type":"text"}]}]},{"content":[{"inlineContent":[{"type":"text","text":"You need a portfolio — Just like when you need to learn something, you build the best portfolio with real work. When we started out all our previous work was confidential and we couldn’t include it in our portfolio so to an outsider that didn’t talk to us it looked like we had no experience. But again, go into this expecting that you will never get any money from that person. And I’d recommend doing something for a charitable organization — it will help you feel better about not getting paid."}],"type":"paragraph"}]},{"content":[{"inlineContent":[{"text":"You aren’t doing anything else — If you are starting a business and still building a client list then you’ll probably have a lot of downtime for the first six months. Doing something for free can be seen as a marketing expense. What can you do that people will see and say “I want to work with those folks!”? We’re building products that we own and providing them to people and organizations we like and hoping it will turn into something more. The best part of this strategy is that we own it still and can use it in other ways in the future.","type":"text"}],"type":"paragraph"},{"type":"paragraph","inlineContent":[{"type":"text","text":"The other benefit is that having this project helps to keep up your momentum. As a small business just starting out it is easy to get slowed down by details and getting your name out there while your motivation grinds to a halt. Having a project with a goal, even if it is for free right now, keeps you going stronger during the slow times."}]}]},{"content":[{"inlineContent":[{"type":"text","text":"You want to give back — If your version of volunteering is giving away your work for free then I think that’s great."}],"type":"paragraph"}]}]},{"inlineContent":[{"type":"text","text":"Looking back over these scenarios, three out of four of them only apply to people getting started in business. If that is all the work you’ve gotten in your first year then I’d be worried about your business."}],"type":"paragraph"},{"type":"paragraph","inlineContent":[{"type":"text","text":"But I also believe that everything you give will come back to you in some way — I’m a hippy like that. If you don’t believe that then giving away anything for free might cause you more cognitive dissidence than any of the benefits are worth. You’ll be mentally kicking yourself for doing it, which isn’t where you want to be."}]}],"kind":"content"}],"variants":[{"paths":["\/documentation\/brunow\/01-09-doing-it-for-free"],"traits":[{"interfaceLanguage":"swift"}]}],"metadata":{"modules":[{"name":"Brunow"}],"platforms":[{"name":"Brunow","introducedAt":"2017.01.20"}],"title":"Doing It For Free","color":{"standardColorIdentifier":"purple"}},"identifier":{"interfaceLanguage":"swift","url":"doc:\/\/Brunow\/documentation\/Brunow\/01-09-doing-it-for-free"},"schemaVersion":{"major":0,"minor":3,"patch":0},"abstract":[{"text":"date: 2016-01-09T08:59:03-06:00","type":"text"}],"references":{"doc://Brunow/documentation/Brunow":{"role":"collection","url":"\/documentation\/brunow","abstract":[{"type":"text","text":"David Brunow, known as Brunow [ˈbɹunoʊ] to the folks he works with, is a human living on Earth. You might have something in common with him — if you think it is ridiculous that he is talking about himself in the first person here, so does he."}],"title":"Brunow","identifier":"doc:\/\/Brunow\/documentation\/Brunow","type":"topic","kind":"symbol"},"doc://Brunow/documentation/Brunow/Archive":{"type":"topic","url":"\/documentation\/brunow\/archive","kind":"article","title":"Archive","abstract":[{"type":"text","text":"All posts"}],"role":"collectionGroup","identifier":"doc:\/\/Brunow\/documentation\/Brunow\/Archive"},"doc://Brunow/documentation/Brunow/2016":{"role":"collectionGroup","title":"2016","type":"topic","kind":"article","url":"\/documentation\/brunow\/2016","abstract":[],"identifier":"doc:\/\/Brunow\/documentation\/Brunow\/2016"}}}