{"variants":[{"traits":[{"interfaceLanguage":"swift"}],"paths":["\/documentation\/brunow\/01-19-natural-talent"]}],"topicSectionsStyle":"detailedGrid","sections":[],"kind":"article","primaryContentSections":[{"content":[{"inlineContent":[{"text":"I’m six and a half feet tall now and in the ninth grade I was six foot one. I got tired of people telling me I should play basketball so I tried out for the team. Before that I had played in my friend’s driveway a few nights a week but until I made the team I didn’t know just how awful I was at the sport.","type":"text"}],"type":"paragraph"},{"type":"paragraph","inlineContent":[{"text":"It took me weeks to be able to make a layup. For people unfamiliar with basketball lingo, a layup is a move where you dribble the ball while running towards the basket and then jump off one foot while moving the ball towards the basket with the opposite hand and gently throwing the ball into the basket. It is the most fundamental basketball move and I could not do it. Every day in practice while the team was working together I would repeatedly try to make a layup.","type":"text"}]},{"inlineContent":[{"text":"Many other things seem to have come easily to me in life. When I was in the Army I was easily able to get physically fit and rank at the top of my class. And shooting a rifle in a straight line was simple as well, other than some small issues with the foxholes not being deep enough and my helmet pushing my glasses off my face.","type":"text"}],"type":"paragraph"},{"type":"paragraph","inlineContent":[{"type":"text","text":"Computers and technology have always been a strength as well. In two months I went from having never written a real program to having a fully functional app in the App Store."}]},{"inlineContent":[{"type":"text","text":"It is so easy for me to look back at these things I’ve described and know I’m good at them and only remember that I’ve always been good at them. It is so easy to forget that initial struggle and to forget all the hard work — all the layups that I missed. It is so easy for anyone to say “I’m not good at this” and just quit."}],"type":"paragraph"},{"inlineContent":[{"text":"I don’t remember everything I’ve ever started and failed, I remember the ones that I’ve stuck with. I remember the things that I’ve spent hours or years improving — so slowly that looking back it seems like it was always there. I got my first computer when I was 13 and became a programmer at 30. I missed a lot of layups.","type":"text"}],"type":"paragraph"},{"inlineContent":[{"text":"Now I look forward to doing a lot of shitty writing and recording a lot of boring podcasts and then finding the next thing that makes me uncomfortable and amateur.","type":"text"}],"type":"paragraph"}],"kind":"content"}],"hierarchy":{"paths":[["doc:\/\/Brunow\/documentation\/Brunow","doc:\/\/Brunow\/documentation\/Brunow\/Archive","doc:\/\/Brunow\/documentation\/Brunow\/2015"]]},"schemaVersion":{"major":0,"patch":0,"minor":3},"identifier":{"interfaceLanguage":"swift","url":"doc:\/\/Brunow\/documentation\/Brunow\/01-19-natural-talent"},"abstract":[{"type":"text","text":"date: 2015-01-19T21:26:42-06:00"}],"metadata":{"title":"Natural Talent","platforms":[{"name":"Brunow","introducedAt":"2017.01.20"}],"modules":[{"name":"Brunow"}],"color":{"standardColorIdentifier":"purple"}},"references":{"doc://Brunow/documentation/Brunow/2015":{"title":"2015","identifier":"doc:\/\/Brunow\/documentation\/Brunow\/2015","url":"\/documentation\/brunow\/2015","kind":"article","role":"collectionGroup","abstract":[],"type":"topic"},"doc://Brunow/documentation/Brunow":{"role":"collection","url":"\/documentation\/brunow","identifier":"doc:\/\/Brunow\/documentation\/Brunow","title":"Brunow","type":"topic","kind":"symbol","abstract":[{"text":"David Brunow, known as Brunow [ˈbɹunoʊ] to the folks he works with, is a human living on Earth. You might have something in common with him — if you think it is ridiculous that he is talking about himself in the first person here, so does he.","type":"text"}]},"doc://Brunow/documentation/Brunow/Archive":{"title":"Archive","type":"topic","role":"collectionGroup","identifier":"doc:\/\/Brunow\/documentation\/Brunow\/Archive","kind":"article","url":"\/documentation\/brunow\/archive","abstract":[{"type":"text","text":"All posts"}]}}}