{"hierarchy":{"paths":[["doc:\/\/Brunow\/documentation\/Brunow","doc:\/\/Brunow\/documentation\/Brunow\/Archive","doc:\/\/Brunow\/documentation\/Brunow\/2015"]]},"schemaVersion":{"patch":0,"major":0,"minor":3},"identifier":{"url":"doc:\/\/Brunow\/documentation\/Brunow\/01-25-gluten-free","interfaceLanguage":"swift"},"metadata":{"color":{"standardColorIdentifier":"purple"},"platforms":[{"name":"Brunow","introducedAt":"2017.01.20"}],"title":"Gluten Free","modules":[{"name":"Brunow"}]},"variants":[{"paths":["\/documentation\/brunow\/01-25-gluten-free"],"traits":[{"interfaceLanguage":"swift"}]}],"abstract":[{"type":"text","text":"date: 2015-01-25T00:15:41-06:00"}],"topicSectionsStyle":"detailedGrid","sections":[],"primaryContentSections":[{"kind":"content","content":[{"inlineContent":[{"text":"My story is gross and embarrassing, in a gastronomical fashion. So beware that.","type":"text"}],"type":"paragraph"},{"type":"paragraph","inlineContent":[{"type":"text","text":"I’ve had stomach issues for a long time — so long that I can’t remember not having them. My issues were diarrhea shortly following each meal and some nights I would spend hours on the toilet. During my year in Iraq, my two biggest worries were getting hit by a mortar while sitting in the port-o-potty and shitting my pants while outside the base. Excursions outside the base were troubling because they got me out of my routine."}]},{"inlineContent":[{"text":"Routine is critical with a gastronomical issue. That makes traveling and adventure not so fun. Life becomes an obstacle course and you become an expert at logistics, always thinking about what restrooms are available. Public restrooms transform from disgusting places you don’t ever want to use into places of salvation.","type":"text"}],"type":"paragraph"},{"inlineContent":[{"text":"It is hard to explain the mental state that accompanies this condition. It’s a combination of fear, a sense of brokenness and that your body is letting you down. And it’s a secret you can’t share with the world because it’s so embarrassing, especially when you have no idea why it happens. It hurts your most important relationships — my significant others have thought that I spent hours in the bathroom to escape them.","type":"text"}],"type":"paragraph"},{"type":"paragraph","inlineContent":[{"type":"text","text":"Eventually, it just becomes a sad fact of life."}]},{"type":"paragraph","inlineContent":[{"type":"text","text":"I tried what I could think of to solve the problem, approaching it like a science experiment, rationally. I removed dairy from my diet, no change. Removed onions, nothing. Avoided spicy foods, nope. Went to doctors that had me shit in a cup for close examination. Ugh, that’s gotta be a tough job for them. Still no answers."}]},{"type":"paragraph","inlineContent":[{"type":"text","text":"My science experiment had a fundamental problem — the human body is a very complex machine and I could never control all the variables. Maybe stress is a factor, things seemed to get worse when I was stressed out, like being in a combat zone or in the tail end of a failing marriage. But that wasn’t a direct correlation either, I still got sick when I felt stress free."}]},{"type":"paragraph","inlineContent":[{"text":"So yeah, complex machine. The complexity of this machine coupled with my general ignorance of anything more than basic anatomy and physiology meant that I wasn’t going to be able to rationally deduce a solution.","type":"text"}]},{"inlineContent":[{"text":"Many times I gave up. Figured it was just how I was plumbed, overly sensitive and fundamentally broken.","type":"text"}],"type":"paragraph"},{"type":"paragraph","inlineContent":[{"type":"text","text":"About two years ago I removed wheat flour from my diet, just to try it. That is a tough thing to do here in North Texas, and it made me feel somewhat un-American. But the results were undeniable. I cannot describe what a joy it is to have a solid bowel movement (and how difficult it is to refrain from sharing the good news with those close to me to avoid grossing them out). After the initial positive results I gave up pretty much anything with wheat in it, the hardest of which was beer. In addition to feeling un-American I felt un-manly, but damn it’s worth it. I experienced an amazing side effect that I never would have expected — years of constant head congestion just went away. Studies show links between food and outdoor allergies, so I assume that was the mechanism."}]},{"type":"paragraph","inlineContent":[{"text":"Fortunately, around the same time that I went gluten free it became a diet trend and it is getting easier and easier to avoid it. Still, eating food cooked by anyone else is risky, and life is riddled with land mines like broccoli cheese soup, soy sauce and barbecue sauces. I usually avoid all sauces because they are just too dangerous.","type":"text"}]},{"type":"paragraph","inlineContent":[{"type":"text","text":"Hope I didn’t gross you out too much. And I "},{"type":"emphasis","inlineContent":[{"type":"text","text":"really"}]},{"type":"text","text":" hope that someone else going through what I went through reads this and I can help save some suffering."}]}]}],"kind":"article","references":{"doc://Brunow/documentation/Brunow/Archive":{"identifier":"doc:\/\/Brunow\/documentation\/Brunow\/Archive","title":"Archive","kind":"article","abstract":[{"type":"text","text":"All posts"}],"url":"\/documentation\/brunow\/archive","role":"collectionGroup","type":"topic"},"doc://Brunow/documentation/Brunow":{"title":"Brunow","kind":"symbol","url":"\/documentation\/brunow","abstract":[{"text":"David Brunow, known as Brunow [ˈbɹunoʊ] to the folks he works with, is a human living on Earth. You might have something in common with him — if you think it is ridiculous that he is talking about himself in the first person here, so does he.","type":"text"}],"role":"collection","identifier":"doc:\/\/Brunow\/documentation\/Brunow","type":"topic"},"doc://Brunow/documentation/Brunow/2015":{"title":"2015","identifier":"doc:\/\/Brunow\/documentation\/Brunow\/2015","abstract":[],"kind":"article","role":"collectionGroup","url":"\/documentation\/brunow\/2015","type":"topic"}}}