{"kind":"article","schemaVersion":{"major":0,"minor":3,"patch":0},"sections":[],"identifier":{"url":"doc:\/\/Brunow\/documentation\/Brunow\/01-20-thoughts-on-strategy","interfaceLanguage":"swift"},"metadata":{"modules":[{"name":"Brunow"}],"title":"Thoughts On Strategy","color":{"standardColorIdentifier":"purple"},"platforms":[{"name":"Brunow","introducedAt":"2017.01.20"}]},"abstract":[{"type":"text","text":"date: 2016-01-20T06:42:08-06:00"}],"primaryContentSections":[{"content":[{"type":"paragraph","inlineContent":[{"type":"text","text":"Yesterday I was driving down the highway to a meeting with a client and saw a vehicle from a previous employer. I left there about 4 years ago and yet one of the programs they were implementing while I was still there is still in place — in essence, it is a debit card rewards program. My initial thought was that they are treating a tactic as a strategy and lacking any real strategy. That may be true but seeing as how I’m not part of the day to day operations it would be arrogant of me to make that assumption. But I do think it is a fun exercise to think about if I remove it from this context and think about banking generically."}]},{"type":"paragraph","inlineContent":[{"text":"I don’t know much about the state of banking today. I have done no research on the subject in years and don’t really care. But I do know my own preferences, which I can use to define at least a small segment of the market. The question is whether that segment is a sign of things to come or just an anomaly. I’d argue that we’re on the cutting edge.","type":"text"}]},{"type":"paragraph","inlineContent":[{"text":"In particular, my preferences are to do all of my banking online or through mobile apps. I have a low threshold for mediocrity in this functionality and if a bank can’t get it right then I lose trust in their competence with not just technology but my money as well.","type":"text"}]},{"inlineContent":[{"type":"text","text":"I see the future of banking being mostly online with much less reliance on physical locations. Due to my viewpoint, I’d lead a bank with a strategy of buying or building the best technology and taking money from physical locations to do that."}],"type":"paragraph"},{"type":"paragraph","inlineContent":[{"text":"But you might not do the same. My strategy depends on my worldview and the future I see through my biases. I could be wrong about any or all of my assumptions. Should I hedge my bets by only moving halfway towards my new strategy and staying halfway in the old one?","type":"text"}]},{"type":"paragraph","inlineContent":[{"text":"I don’t think so. I think you should move forward with the strategy you see but keep your eyes open to signs that you might be on the wrong path. Find ways to test your assumptions along the way, but go forward with all your effort behind it.","type":"text"}]},{"type":"paragraph","inlineContent":[{"text":"While thinking through this exercise I’ve realized that we haven’t done any of this for our company. We thought we saw a need and are doing what we can to meet that need without any real plan. Maybe strategy comes later.","type":"text"}]}],"kind":"content"}],"variants":[{"paths":["\/documentation\/brunow\/01-20-thoughts-on-strategy"],"traits":[{"interfaceLanguage":"swift"}]}],"hierarchy":{"paths":[["doc:\/\/Brunow\/documentation\/Brunow","doc:\/\/Brunow\/documentation\/Brunow\/Archive","doc:\/\/Brunow\/documentation\/Brunow\/2016"]]},"topicSectionsStyle":"detailedGrid","references":{"doc://Brunow/documentation/Brunow/2016":{"url":"\/documentation\/brunow\/2016","type":"topic","title":"2016","kind":"article","role":"collectionGroup","identifier":"doc:\/\/Brunow\/documentation\/Brunow\/2016","abstract":[]},"doc://Brunow/documentation/Brunow/Archive":{"role":"collectionGroup","abstract":[{"type":"text","text":"All posts"}],"title":"Archive","identifier":"doc:\/\/Brunow\/documentation\/Brunow\/Archive","type":"topic","kind":"article","url":"\/documentation\/brunow\/archive"},"doc://Brunow/documentation/Brunow":{"url":"\/documentation\/brunow","role":"collection","identifier":"doc:\/\/Brunow\/documentation\/Brunow","kind":"symbol","abstract":[{"text":"David Brunow, known as Brunow [ˈbɹunoʊ] to the folks he works with, is a human living on Earth. You might have something in common with him — if you think it is ridiculous that he is talking about himself in the first person here, so does he.","type":"text"}],"type":"topic","title":"Brunow"}}}