{"primaryContentSections":[{"kind":"content","content":[{"type":"paragraph","inlineContent":[{"type":"text","text":"Many of the things that I write here lack supporting data. And sometimes that is OK — I don’t always need data to support my opinions. I will never find data to support why I think vanilla is better than chocolate."}]},{"type":"paragraph","inlineContent":[{"type":"text","text":"The supporting data is what changes an opinion into a theory or a complaint into a criticism. It forces you to prove your beliefs to yourself because you have to collect and validate the data. It doesn’t allow you to hide behind lazy statements like “ask any professional violinist and you’ll know what I mean.” It also spurs conversation because it gives your audience specific points to discuss."}]},{"type":"paragraph","inlineContent":[{"text":"When I make a statement and don’t provide my supporting data it is usually due to one or more of three reasons: I’m being lazy, I’m asserting an opinion on something about which I have no data, or I’m assuming a tacit level of knowledge in my readers. I think reasons two and three are OK. As I’ve written about before I believe it is valuable to share my opinions even if they are not fully formed. Sometimes I’ll just have to say “this is how I feel about it but I’m not exactly sure why.” And we all have to assume a certain level of tacit knowledge, although I think I’ll constantly be working on the right balance.","type":"text"}]},{"inlineContent":[{"type":"text","text":"But laziness isn’t a good excuse. Trying to prove a point with hand-wavy “facts” is worse than stating an opinion because it is trying to trick your audience and probably trying to trick yourself. Not looking up easily accessible data is not OK because based upon my experience, I will completely lose faith in your competence after you’ve told me a few things that I can quickly find are wrong."}],"type":"paragraph"},{"type":"paragraph","inlineContent":[{"text":"I’m going to work harder on thinking about what supporting data I can provide for everything I do. I think that’s one of the differences that sets a professional apart from an amateur.","type":"text"}]}]}],"topicSectionsStyle":"detailedGrid","metadata":{"title":"Providing The Supporting Data","platforms":[{"introducedAt":"2017.01.20","name":"Brunow"}],"modules":[{"name":"Brunow"}],"color":{"standardColorIdentifier":"purple"}},"hierarchy":{"paths":[["doc:\/\/Brunow\/documentation\/Brunow","doc:\/\/Brunow\/documentation\/Brunow\/Archive","doc:\/\/Brunow\/documentation\/Brunow\/2015"]]},"identifier":{"interfaceLanguage":"swift","url":"doc:\/\/Brunow\/documentation\/Brunow\/02-15-providing-the-supporting-data"},"kind":"article","abstract":[{"type":"text","text":"date: 2015-02-15T23:43:19-06:00"}],"variants":[{"traits":[{"interfaceLanguage":"swift"}],"paths":["\/documentation\/brunow\/02-15-providing-the-supporting-data"]}],"schemaVersion":{"minor":3,"major":0,"patch":0},"sections":[],"references":{"doc://Brunow/documentation/Brunow/2015":{"role":"collectionGroup","kind":"article","abstract":[],"title":"2015","type":"topic","identifier":"doc:\/\/Brunow\/documentation\/Brunow\/2015","url":"\/documentation\/brunow\/2015"},"doc://Brunow/documentation/Brunow":{"type":"topic","url":"\/documentation\/brunow","title":"Brunow","identifier":"doc:\/\/Brunow\/documentation\/Brunow","abstract":[{"type":"text","text":"David Brunow, known as Brunow [ˈbɹunoʊ] to the folks he works with, is a human living on Earth. You might have something in common with him — if you think it is ridiculous that he is talking about himself in the first person here, so does he."}],"role":"collection","kind":"symbol"},"doc://Brunow/documentation/Brunow/Archive":{"identifier":"doc:\/\/Brunow\/documentation\/Brunow\/Archive","abstract":[{"type":"text","text":"All posts"}],"title":"Archive","role":"collectionGroup","kind":"article","url":"\/documentation\/brunow\/archive","type":"topic"}}}