{"variants":[{"paths":["\/documentation\/brunow\/02-19-my-approach-to-building-websites"],"traits":[{"interfaceLanguage":"swift"}]}],"abstract":[{"type":"text","text":"date: 2016-02-19T07:24:34-06:00"}],"schemaVersion":{"major":0,"minor":3,"patch":0},"primaryContentSections":[{"kind":"content","content":[{"type":"paragraph","inlineContent":[{"text":"Yesterday I was fixing a form for a website I didn’t build. Another team built it sometime in the past, using HTML and PHP. My first task was figuring out why the form wasn’t working intermittently and then to fix it. Intermittent issues are frustrating by themselves but get even more so when you have no idea which parts of what are doing what actions and have to dig through the code to figure it out. Every implementation of sending email is fundamentally the same, but that still leaves a huge opportunity for different implementation choices.","type":"text"}]},{"type":"paragraph","inlineContent":[{"text":"This incident made me realize a part of my preference for building websites that feels contrary to my usual philosophy. Usually I want to control everything and that control generally means building components myself and keeping them on my own server. But I don’t want to build form submission components. I don’t want to run PHP or any other language on my server if I can help it. I don’t want to slow down my site with any of that complexity, and I don’t want to have to worry about the additional attack vectors that enabling a server side language or database create.","type":"text"}]},{"type":"paragraph","inlineContent":[{"text":"I just want a widget, that I can fully customize, that handles form submission for me. They worry about getting the client and server side validation right. They worry about the mail server and credentials and what not. I drop it into the page in static HTML or through asynchronous JavaScript and it doesn’t slow down my site or put me in a position where I’m digging through my own code in a couple of years trying to figure out what I did originally and what I broke.","type":"text"}]},{"type":"paragraph","inlineContent":[{"type":"text","text":"It’s weird to me that I don’t care about having 100% control in this situation, and I’m not sure if I can define what is different between this and the situations where I do want control. Maybe it is because the components are simple and fully contained which makes them easy to just plug into everything else without cross contamination."}]}]}],"identifier":{"url":"doc:\/\/Brunow\/documentation\/Brunow\/02-19-my-approach-to-building-websites","interfaceLanguage":"swift"},"kind":"article","hierarchy":{"paths":[["doc:\/\/Brunow\/documentation\/Brunow","doc:\/\/Brunow\/documentation\/Brunow\/Archive","doc:\/\/Brunow\/documentation\/Brunow\/2016"]]},"metadata":{"modules":[{"name":"Brunow"}],"title":"My Approach To Building Websites","platforms":[{"introducedAt":"2017.01.20","name":"Brunow"}],"color":{"standardColorIdentifier":"purple"}},"topicSectionsStyle":"detailedGrid","sections":[],"references":{"doc://Brunow/documentation/Brunow/Archive":{"type":"topic","kind":"article","role":"collectionGroup","abstract":[{"type":"text","text":"All posts"}],"title":"Archive","identifier":"doc:\/\/Brunow\/documentation\/Brunow\/Archive","url":"\/documentation\/brunow\/archive"},"doc://Brunow/documentation/Brunow":{"type":"topic","role":"collection","title":"Brunow","kind":"symbol","abstract":[{"text":"David Brunow, known as Brunow [ˈbɹunoʊ] to the folks he works with, is a human living on Earth. You might have something in common with him — if you think it is ridiculous that he is talking about himself in the first person here, so does he.","type":"text"}],"identifier":"doc:\/\/Brunow\/documentation\/Brunow","url":"\/documentation\/brunow"},"doc://Brunow/documentation/Brunow/2016":{"type":"topic","kind":"article","role":"collectionGroup","abstract":[],"title":"2016","identifier":"doc:\/\/Brunow\/documentation\/Brunow\/2016","url":"\/documentation\/brunow\/2016"}}}