{"schemaVersion":{"minor":3,"patch":0,"major":0},"metadata":{"title":"Scheduling","color":{"standardColorIdentifier":"purple"},"modules":[{"name":"Brunow"}],"platforms":[{"name":"Brunow","introducedAt":"2017.01.20"}]},"hierarchy":{"paths":[["doc:\/\/Brunow\/documentation\/Brunow","doc:\/\/Brunow\/documentation\/Brunow\/Archive","doc:\/\/Brunow\/documentation\/Brunow\/2016"]]},"identifier":{"interfaceLanguage":"swift","url":"doc:\/\/Brunow\/documentation\/Brunow\/03-03-scheduling"},"abstract":[{"text":"date: 2016-03-03T06:10:00-06:00","type":"text"}],"primaryContentSections":[{"content":[{"type":"paragraph","inlineContent":[{"text":"As a relatively new business owner I’m learning a lot and getting to see where I’m weak and need to develop skills. One of the biggest areas I need to improve is in scheduling my time and projects. I’ve felt this more than ever before in the last month as every project took longer than I estimated and spilled over into the time for the next project. Fortunately I can still deliver things on time by working more but that only works in the short term. Eventually I’ll run out of energy and burn out.","type":"text"}]},{"type":"paragraph","inlineContent":[{"type":"text","text":"I have a new appreciation for why consulting companies emphasize limiting scope creep. Adding just one little feature can change the length of the entire project and then impact other projects. Despite my new appreciation I still believe that most limits on changes in scope mean that the final product isn’t as good as it could be. You still won’t hear me fight against implementing a good idea because it wasn’t in the original scope. The original scope didn’t know what we know now and each decision to add something must be weighed on its own."}]},{"type":"paragraph","inlineContent":[{"type":"text","text":"I think the way we’ll approach the problem of overwork is by saying no to projects. The combination of wanting to help everyone and projects being hard to come by in our first year meant we’ve said yes to every project we’ve had an opportunity to do. Once we aren’t concerned with feeding ourselves we will feel more comfortable saying “sorry we’re too busy right this moment.”"}]},{"inlineContent":[{"type":"text","text":"I think that will be the biggest part of keeping ourselves at the right level or work. The other thing that got us in a situation of being overworked this month was projects that kept going for months while we waiting on others to do their things. Unfortunately multiple of those were ready for us at the same time which in my mind is something we can’t predict or control but just have to live with and fight through."}],"type":"paragraph"}],"kind":"content"}],"topicSectionsStyle":"detailedGrid","kind":"article","sections":[],"variants":[{"traits":[{"interfaceLanguage":"swift"}],"paths":["\/documentation\/brunow\/03-03-scheduling"]}],"references":{"doc://Brunow/documentation/Brunow/2016":{"title":"2016","url":"\/documentation\/brunow\/2016","abstract":[],"role":"collectionGroup","identifier":"doc:\/\/Brunow\/documentation\/Brunow\/2016","type":"topic","kind":"article"},"doc://Brunow/documentation/Brunow":{"type":"topic","role":"collection","identifier":"doc:\/\/Brunow\/documentation\/Brunow","abstract":[{"type":"text","text":"David Brunow, known as Brunow [ˈbɹunoʊ] to the folks he works with, is a human living on Earth. You might have something in common with him — if you think it is ridiculous that he is talking about himself in the first person here, so does he."}],"title":"Brunow","kind":"symbol","url":"\/documentation\/brunow"},"doc://Brunow/documentation/Brunow/Archive":{"url":"\/documentation\/brunow\/archive","kind":"article","role":"collectionGroup","title":"Archive","type":"topic","identifier":"doc:\/\/Brunow\/documentation\/Brunow\/Archive","abstract":[{"type":"text","text":"All posts"}]}}}