{"identifier":{"interfaceLanguage":"swift","url":"doc:\/\/Brunow\/documentation\/Brunow\/03-14-owning-the-stack"},"metadata":{"title":"Owning The Stack","modules":[{"name":"Brunow"}],"platforms":[{"introducedAt":"2017.01.20","name":"Brunow"}],"color":{"standardColorIdentifier":"purple"}},"topicSectionsStyle":"detailedGrid","schemaVersion":{"patch":0,"major":0,"minor":3},"primaryContentSections":[{"kind":"content","content":[{"type":"paragraph","inlineContent":[{"type":"text","text":"I like control. I want my tools to do what I expect of them. I want to change things to make them fit into my vision. I definitely don’t want my tools changing things on me without my knowledge."}]},{"type":"paragraph","inlineContent":[{"text":"I know that my way isn’t the only way. I know that some people don’t care about as fine grained control. And I also know that the huge variety of tools out there for people to share their ideas and themselves is a wonderful thing. But it’s not for me. I want control. I want to see the moving parts. In the tech world, we call this “owning the stack” because we have control over all the parts of the thing we are building from the server to the database to the app.","type":"text"}]},{"inlineContent":[{"text":"To once again apply these thoughts to photography, which I will once again admit to not being an expert with, I see it as the difference between a phone camera and an SLR. I can take awesome photos with my iPhone but I can’t take the photos I have a vision of taking, for example a picture with a shallow focal depth that has me in focus and the background blurry. It’s the same thing I want when I’m making an app — I want to control the focus, lighting, everything. The iPhone doesn’t easily allow that level of control.","type":"text"}],"type":"paragraph"},{"inlineContent":[{"type":"text","text":"The desire for control factors heavily into every decision I make when I’m building something. And one of the beautiful things about controlling everything is that I get to make all the decisions. I know the consequences of them and what compromises I must make — do I want super fast page loading or super high quality images or something in the middle? On my server, writing my code, I can control that. I can’t do that on SquareSpace. If I build a site on SquareSpace and a user says it loads really slowly for them I don’t have a lot of options to fix the problem. That’s the downside of it being really easy to build a site. And that will work great for 90% of people, but it’s just not for me. I hate giving an answer of “no, I can’t do that because of the technology I chose.” That kind of philosophy has given the tech world a bad name."}],"type":"paragraph"},{"type":"paragraph","inlineContent":[{"type":"text","text":"Would it be too bold to say that my desire for control is a mark of a professional? I don’t think so."}]}]}],"variants":[{"paths":["\/documentation\/brunow\/03-14-owning-the-stack"],"traits":[{"interfaceLanguage":"swift"}]}],"abstract":[{"type":"text","text":"date: 2015-03-14T00:28:19-05:00"}],"kind":"article","sections":[],"hierarchy":{"paths":[["doc:\/\/Brunow\/documentation\/Brunow","doc:\/\/Brunow\/documentation\/Brunow\/Archive","doc:\/\/Brunow\/documentation\/Brunow\/2015"]]},"references":{"doc://Brunow/documentation/Brunow/2015":{"title":"2015","identifier":"doc:\/\/Brunow\/documentation\/Brunow\/2015","abstract":[],"kind":"article","role":"collectionGroup","url":"\/documentation\/brunow\/2015","type":"topic"},"doc://Brunow/documentation/Brunow":{"title":"Brunow","kind":"symbol","url":"\/documentation\/brunow","abstract":[{"text":"David Brunow, known as Brunow [ˈbɹunoʊ] to the folks he works with, is a human living on Earth. You might have something in common with him — if you think it is ridiculous that he is talking about himself in the first person here, so does he.","type":"text"}],"role":"collection","identifier":"doc:\/\/Brunow\/documentation\/Brunow","type":"topic"},"doc://Brunow/documentation/Brunow/Archive":{"identifier":"doc:\/\/Brunow\/documentation\/Brunow\/Archive","title":"Archive","kind":"article","abstract":[{"type":"text","text":"All posts"}],"url":"\/documentation\/brunow\/archive","role":"collectionGroup","type":"topic"}}}