{"hierarchy":{"paths":[["doc:\/\/Brunow\/documentation\/Brunow","doc:\/\/Brunow\/documentation\/Brunow\/Archive","doc:\/\/Brunow\/documentation\/Brunow\/2015"]]},"metadata":{"title":"I Want To Know Who I’m Working With","modules":[{"name":"Brunow"}],"platforms":[{"introducedAt":"2017.01.20","name":"Brunow"}],"color":{"standardColorIdentifier":"purple"}},"sections":[],"primaryContentSections":[{"kind":"content","content":[{"inlineContent":[{"type":"text","text":"I’m looking at a lot of websites for local businesses right now and I’m surprised by how many of them don’t tell me anything about the people that work there. It seems crazy to me, why wouldn’t a small business owner want to prioritize one of her biggest forms of differentiation — the fact that she is a person who lives in the community and cares about her work? She could be the antithesis to the faceless corporation. But for some reason she isn’t."}],"type":"paragraph"},{"inlineContent":[{"type":"text","text":"One reason I’ve heard is that small businesses want to seem larger than they are. Multiple small business owners have said that to me and I don’t know whether to believe their anecdotal evidence. Personally, I would much rather do business with a highly qualified individual running his own business than an employee of a 100 person business. I guess size doesn’t matter to me. Let me know "},{"isActive":true,"type":"reference","identifier":"https:\/\/www.twitter.com\/davidbrunow"},{"text":" how you feel about it.","type":"text"}],"type":"paragraph"},{"inlineContent":[{"text":"Another reason I can think of has to do with website maintenance. If you have employees that leave then it could look bad to have them on your site at any point in time. And you have to have ","type":"text"},{"type":"reference","isActive":true,"identifier":"http:\/\/ShepherdDog.co\/technology-services\/index.html#website-maintenance"},{"text":" or things will quickly look out of date. I get that. But being able to put a face with a name makes such a huge difference on an instinctual level. And maybe that’s the problem — the fear that if someone dislikes me in their gut the moment they see my face then I’ve lost a client before I’ve even had a chance. That is scary. But I doubt that my face — or your face — would have that kind of impact on any sizable part of the population. But if a potential client can’t see me then they can only judge the text on the page. And if my competitor has a picture then my text won’t stand a chance against a human face (assuming, as I stated above, that only a small amount of the population will dislike that human face instinctually.) Back to the point about employees leaving. Yes, if you constantly have different people on your site it will look bad. But it looking bad will be the least of your concerns because if that is happening then your company is in trouble anyway because you won’t have sufficiently trained employees. If someone leaves your company every once in a while then people might notice, but they all know that people change jobs. Hell, they might have even changed jobs themselves once or twice.","type":"text"}],"type":"paragraph"},{"type":"paragraph","inlineContent":[{"type":"text","text":"So what else am I missing? Maybe people think it is hard to take good pictures of themselves to put up there? Maybe they don’t want the entire Internet to get into their private life? What else am I missing? And is any reason good enough to not have your picture there?"}]}]}],"kind":"article","variants":[{"paths":["\/documentation\/brunow\/03-16-i-want-to-know-who-i'm-working-with"],"traits":[{"interfaceLanguage":"swift"}]}],"topicSectionsStyle":"detailedGrid","schemaVersion":{"major":0,"minor":3,"patch":0},"identifier":{"interfaceLanguage":"swift","url":"doc:\/\/Brunow\/documentation\/Brunow\/03-16-i-want-to-know-who-i'm-working-with"},"abstract":[{"text":"date: 2015-03-16T22:39:51-05:00","type":"text"}],"references":{"doc://Brunow/documentation/Brunow":{"url":"\/documentation\/brunow","title":"Brunow","role":"collection","kind":"symbol","type":"topic","identifier":"doc:\/\/Brunow\/documentation\/Brunow","abstract":[{"type":"text","text":"David Brunow, known as Brunow [ˈbɹunoʊ] to the folks he works with, is a human living on Earth. You might have something in common with him — if you think it is ridiculous that he is talking about himself in the first person here, so does he."}]},"doc://Brunow/documentation/Brunow/Archive":{"url":"\/documentation\/brunow\/archive","title":"Archive","role":"collectionGroup","kind":"article","type":"topic","identifier":"doc:\/\/Brunow\/documentation\/Brunow\/Archive","abstract":[{"text":"All posts","type":"text"}]},"http://ShepherdDog.co/technology-services/index.html#website-maintenance":{"url":"http:\/\/ShepherdDog.co\/technology-services\/index.html#website-maintenance","title":"a way to easily maintain your site when that happens","identifier":"http:\/\/ShepherdDog.co\/technology-services\/index.html#website-maintenance","titleInlineContent":[{"type":"text","text":"a way to easily maintain your site when that happens"}],"type":"link"},"https://www.twitter.com/davidbrunow":{"titleInlineContent":[{"text":"on Twitter","type":"text"}],"url":"https:\/\/www.twitter.com\/davidbrunow","title":"on Twitter","identifier":"https:\/\/www.twitter.com\/davidbrunow","type":"link"},"doc://Brunow/documentation/Brunow/2015":{"type":"topic","kind":"article","title":"2015","identifier":"doc:\/\/Brunow\/documentation\/Brunow\/2015","role":"collectionGroup","url":"\/documentation\/brunow\/2015","abstract":[]}}}