{"hierarchy":{"paths":[["doc:\/\/Brunow\/documentation\/Brunow","doc:\/\/Brunow\/documentation\/Brunow\/Archive","doc:\/\/Brunow\/documentation\/Brunow\/2015"]]},"schemaVersion":{"minor":3,"major":0,"patch":0},"topicSectionsStyle":"detailedGrid","identifier":{"url":"doc:\/\/Brunow\/documentation\/Brunow\/03-24-why-would-you-want-to-live-in-that-future","interfaceLanguage":"swift"},"sections":[],"metadata":{"platforms":[{"introducedAt":"2017.01.20","name":"Brunow"}],"title":"Why Would You Want To Live In That Future","color":{"standardColorIdentifier":"purple"},"modules":[{"name":"Brunow"}]},"kind":"article","primaryContentSections":[{"content":[{"type":"paragraph","inlineContent":[{"type":"text","text":"Fear is powerful. My greatest fears are the unknowns and the greatest unknown for me is the future. It is so easy to let that fear take over and prepare a fear based reaction to things that might never happen. When I do this I throw myself into a future that I don’t have all the tools to handle. For example, if I try right now to live in my future that will happen in a couple of weeks where I’m trying to figure out how to handle taxes when I’m self employed and have almost no income (which I have no clue about right now) then I won’t have the tools of any research I can do on the topic or professional advice I can seek. I’m setting myself up for failure."}]},{"inlineContent":[{"text":"Here’s a question I came up with the other day that stuck with me, “Why would you want to live in that future?” Why do I want to put myself in a position where I can only fail like I described above? Or why would I want to imagine a series of worst case scenarios three steps into the future when I have no indication that step one won’t go smoothly?","type":"text"}],"type":"paragraph"},{"type":"paragraph","inlineContent":[{"type":"text","text":"Planning definitely has its place but it can quickly turn into living in a fear based future. Yes, if you have all the information you need (or all you’re going to get even if you need more) then go ahead and plan. I suggest you sit down and make a task of it, rather than letting it take over your thoughts while your doing some other mindless task like driving."}]},{"type":"paragraph","inlineContent":[{"type":"text","text":"But if you are still waiting for information then let it go. Put it on your calendar or task list for later if that helps you let it go. If I’ve just submitted an iPhone app for review by Apple I don’t need to plan for the possibility of it getting rejected. I’ll handle that when it happens. Why would I want to live in that imaginary future?"}]}],"kind":"content"}],"variants":[{"paths":["\/documentation\/brunow\/03-24-why-would-you-want-to-live-in-that-future"],"traits":[{"interfaceLanguage":"swift"}]}],"abstract":[{"type":"text","text":"date: 2015-03-24T22:53:27-05:00"}],"references":{"doc://Brunow/documentation/Brunow":{"kind":"symbol","role":"collection","type":"topic","identifier":"doc:\/\/Brunow\/documentation\/Brunow","abstract":[{"text":"David Brunow, known as Brunow [ˈbɹunoʊ] to the folks he works with, is a human living on Earth. You might have something in common with him — if you think it is ridiculous that he is talking about himself in the first person here, so does he.","type":"text"}],"title":"Brunow","url":"\/documentation\/brunow"},"doc://Brunow/documentation/Brunow/Archive":{"kind":"article","url":"\/documentation\/brunow\/archive","identifier":"doc:\/\/Brunow\/documentation\/Brunow\/Archive","title":"Archive","role":"collectionGroup","abstract":[{"type":"text","text":"All posts"}],"type":"topic"},"doc://Brunow/documentation/Brunow/2015":{"kind":"article","url":"\/documentation\/brunow\/2015","identifier":"doc:\/\/Brunow\/documentation\/Brunow\/2015","title":"2015","role":"collectionGroup","abstract":[],"type":"topic"}}}