{"variants":[{"traits":[{"interfaceLanguage":"swift"}],"paths":["\/documentation\/brunow\/03-30-tools"]}],"hierarchy":{"paths":[["doc:\/\/Brunow\/documentation\/Brunow","doc:\/\/Brunow\/documentation\/Brunow\/Archive","doc:\/\/Brunow\/documentation\/Brunow\/2016"]]},"kind":"article","identifier":{"interfaceLanguage":"swift","url":"doc:\/\/Brunow\/documentation\/Brunow\/03-30-tools"},"abstract":[{"type":"text","text":"date: 2016-03-30T22:26:19-05:00"}],"topicSectionsStyle":"detailedGrid","sections":[],"schemaVersion":{"patch":0,"minor":3,"major":0},"metadata":{"platforms":[{"introducedAt":"2017.01.20","name":"Brunow"}],"color":{"standardColorIdentifier":"purple"},"modules":[{"name":"Brunow"}],"title":"Tools"},"primaryContentSections":[{"kind":"content","content":[{"inlineContent":[{"text":"I started thinking about tools this morning and came up with this matrix:","type":"text"}],"type":"paragraph"},{"type":"paragraph","inlineContent":[{"text":"I think it is accurate but I’m not sure how useful it is or how it could be used.","type":"text"}]},{"type":"paragraph","inlineContent":[{"type":"text","text":"I’ll explain it a bit."}]},{"type":"paragraph","inlineContent":[{"text":"As you can see in the top left quadrant, it is easy to find tools for common, simple tasks. For example, putting a hole in your wall to hang something. You can pick up a hammer and a nail at a local hardware store for a very low cost.","type":"text"}]},{"inlineContent":[{"type":"text","text":"In the bottom left quadrant are tasks that are more specific to your needs or that you may only need to do every once in a while. Because they are rare you are unlikely to have the perfect tool but because they are simple you can probably adapt one you already have. For example, here in the southern United States we don’t get much winter weather so I don’t have a tool for getting ice off my windshield, but a credit card will do the job."}],"type":"paragraph"},{"type":"paragraph","inlineContent":[{"text":"The top right quadrant is complicated but common tasks. It is still easy to find tools although they are generally more expensive than simple tools. Due to the high level of complexity the tool must have more generic features in order to keep the problem common and to solve it for as many people as possible. But due to the tool being more generic, you must adapt to it. Most computers and software would be in this category. For example, if you need to send email newsletters you have a variety of tools available but you will need to learn the way they work rather than it adapting to your needs. You have to follow its workflow.","type":"text"}]},{"inlineContent":[{"text":"The bottom right quadrant contains complicated and uncommon tasks. For these you usually have to create your own tools. For example, if you’ve created a piece of hardware with novel functionality and you want to be able to control it with your phone over the Internet you won’t find an off-the-shelf solution. This is the quadrant I like to live in because I really like creating these tools for people.","type":"text"}],"type":"paragraph"}]}],"references":{"doc://Brunow/documentation/Brunow":{"url":"\/documentation\/brunow","kind":"symbol","identifier":"doc:\/\/Brunow\/documentation\/Brunow","type":"topic","abstract":[{"text":"David Brunow, known as Brunow [ˈbɹunoʊ] to the folks he works with, is a human living on Earth. You might have something in common with him — if you think it is ridiculous that he is talking about himself in the first person here, so does he.","type":"text"}],"role":"collection","title":"Brunow"},"doc://Brunow/documentation/Brunow/Archive":{"url":"\/documentation\/brunow\/archive","abstract":[{"text":"All posts","type":"text"}],"kind":"article","type":"topic","role":"collectionGroup","identifier":"doc:\/\/Brunow\/documentation\/Brunow\/Archive","title":"Archive"},"doc://Brunow/documentation/Brunow/2016":{"title":"2016","url":"\/documentation\/brunow\/2016","kind":"article","role":"collectionGroup","abstract":[],"type":"topic","identifier":"doc:\/\/Brunow\/documentation\/Brunow\/2016"}}}