{"abstract":[{"text":"date: 2015-03-31T21:36:48-05:00","type":"text"}],"hierarchy":{"paths":[["doc:\/\/Brunow\/documentation\/Brunow","doc:\/\/Brunow\/documentation\/Brunow\/Archive","doc:\/\/Brunow\/documentation\/Brunow\/2015"]]},"sections":[],"schemaVersion":{"major":0,"minor":3,"patch":0},"topicSectionsStyle":"detailedGrid","primaryContentSections":[{"content":[{"type":"paragraph","inlineContent":[{"type":"text","text":"One of the most difficult things about sticking with something new like an exercise routine, diet, training program, or a new business is believing that sticking with what you’re doing will give you the outcome you wanted at the beginning. With a daily running routine this difficulty may come in the form of thoughts in your head telling you that you aren’t making progress after just a week of running. With a training program you may start to believe that you just can’t learn what you’re trying to learn because it doesn’t feel like you’ve made any progress."}]},{"type":"paragraph","inlineContent":[{"text":"The time it takes to see your outcomes feels like forever when you’re in the middle of it. When our attention changes by the minute or second, the month it takes to see improvements from running every day feels like forever. The progress is slow, steady, and largely invisible.","type":"text"}]},{"type":"paragraph","inlineContent":[{"type":"text","text":"Many people give up new things quickly because of these thoughts in their head. They are convinced that what they wanted at the beginning isn’t possible. They won’t ever get into better shape by running. They won’t ever learn that new thing because it’s just not one of their natural talents. They close down their new business because it isn’t ever going to take off."}]},{"type":"paragraph","inlineContent":[{"text":"Another group of people handles those thoughts differently but nearly as destructively. When she doesn’t see progress from running in a week, she changes her exercise program to lifting weights instead. And then a week later changes it to something else. She feels she has better control over the outcome. When he doesn’t feel like he’s learned anything in a week he tries something else, something closer to his areas of expertise. When the new business isn’t attracting customers they decide to go after a different group of customers. This group is just as likely to succeed as the first group.","type":"text"}]},{"type":"paragraph","inlineContent":[{"type":"text","text":"The hardest part about doing just about anything is sticking to it. Doing the exact same thing day after day. Putting in the work with what feels like no guarantee of an outcome. Seeing no forward progress but continuing to put one foot in front of the other."}]},{"inlineContent":[{"type":"text","text":"Consistency is the key to success. Believe in the outcome."}],"type":"paragraph"}],"kind":"content"}],"variants":[{"paths":["\/documentation\/brunow\/03-31-believing-in-the-outcome"],"traits":[{"interfaceLanguage":"swift"}]}],"identifier":{"url":"doc:\/\/Brunow\/documentation\/Brunow\/03-31-believing-in-the-outcome","interfaceLanguage":"swift"},"kind":"article","metadata":{"color":{"standardColorIdentifier":"purple"},"modules":[{"name":"Brunow"}],"platforms":[{"name":"Brunow","introducedAt":"2017.01.20"}],"title":"Believing in the Outcome"},"references":{"doc://Brunow/documentation/Brunow":{"url":"\/documentation\/brunow","title":"Brunow","kind":"symbol","type":"topic","role":"collection","identifier":"doc:\/\/Brunow\/documentation\/Brunow","abstract":[{"type":"text","text":"David Brunow, known as Brunow [ˈbɹunoʊ] to the folks he works with, is a human living on Earth. You might have something in common with him — if you think it is ridiculous that he is talking about himself in the first person here, so does he."}]},"doc://Brunow/documentation/Brunow/Archive":{"kind":"article","role":"collectionGroup","abstract":[{"text":"All posts","type":"text"}],"url":"\/documentation\/brunow\/archive","type":"topic","title":"Archive","identifier":"doc:\/\/Brunow\/documentation\/Brunow\/Archive"},"doc://Brunow/documentation/Brunow/2015":{"title":"2015","role":"collectionGroup","abstract":[],"identifier":"doc:\/\/Brunow\/documentation\/Brunow\/2015","url":"\/documentation\/brunow\/2015","type":"topic","kind":"article"}}}