{"sections":[],"hierarchy":{"paths":[["doc:\/\/Brunow\/documentation\/Brunow","doc:\/\/Brunow\/documentation\/Brunow\/Archive","doc:\/\/Brunow\/documentation\/Brunow\/2015"]]},"schemaVersion":{"major":0,"minor":3,"patch":0},"primaryContentSections":[{"content":[{"type":"paragraph","inlineContent":[{"type":"text","text":"I’ve been kicking this idea around for years and in the spirit of non-secrecy I decided I’d share it. I’m not actively working on it and have no plans to do so at this time. I haven’t done research on it in a while so someone might already be pursuing it."}]},{"type":"paragraph","inlineContent":[{"type":"text","text":"So here’s the idea — a closet inventory management system that tracks what you wear, the last time you wore it, how often you wear it, and allows you to share as much or as little of that information with friends and followers."}]},{"type":"paragraph","inlineContent":[{"type":"text","text":"I think we are coming up on the time when this idea is starting to be feasible. The biggest hurdle is “How do I allow users to track this information in a way that isn’t awful?” Very few users are going to want to put their entire closet into an app. Very few users are going to remember to input each piece of their outfit into the app daily. These are the problems that calorie tracking apps face also. But I think that either RFID or Bluetooth LE can fix these problems. Unlike food, either RFID or Bluetooth LE tags can be embedded into clothing by sewing them into a tag or part of the stitching. The app would need to be smart enough to know what you are wearing simply by seeing what tags are close to it."}]},{"inlineContent":[{"text":"I’d try to build it as a free service — forever free to the users. To get started I’d want to go to people’s closets and add these tags to all their clothing and build up the database of clothing. It would be a very manual and non-scalable process to start.","type":"text"}],"type":"paragraph"},{"inlineContent":[{"type":"text","text":"At the same time I’d be selling the idea to the clothing brands. I’d say “Look at all this data we can collect about your customers. Look at how easily they can share exactly what their wearing — down to the item number — with their friends. I’d charge them a monthly fee for access to incoming data. I’d ask them to embed the RFID or Bluetooth LE tags in their clothes. They’d bear that cost as a marketing expense."}],"type":"paragraph"},{"inlineContent":[{"type":"text","text":"So what do you think? Have you heard of someone already building this? Does this seem like a good idea? Does the thought of making it excite you?"}],"type":"paragraph"}],"kind":"content"}],"metadata":{"title":"A Startup Idea","modules":[{"name":"Brunow"}],"platforms":[{"introducedAt":"2017.01.20","name":"Brunow"}],"color":{"standardColorIdentifier":"purple"}},"abstract":[{"type":"text","text":"date: 2015-04-19T22:40:26-05:00"}],"topicSectionsStyle":"detailedGrid","identifier":{"interfaceLanguage":"swift","url":"doc:\/\/Brunow\/documentation\/Brunow\/04-19-a-startup-idea"},"variants":[{"traits":[{"interfaceLanguage":"swift"}],"paths":["\/documentation\/brunow\/04-19-a-startup-idea"]}],"kind":"article","references":{"doc://Brunow/documentation/Brunow/Archive":{"url":"\/documentation\/brunow\/archive","title":"Archive","role":"collectionGroup","kind":"article","type":"topic","identifier":"doc:\/\/Brunow\/documentation\/Brunow\/Archive","abstract":[{"text":"All posts","type":"text"}]},"doc://Brunow/documentation/Brunow/2015":{"type":"topic","kind":"article","title":"2015","identifier":"doc:\/\/Brunow\/documentation\/Brunow\/2015","role":"collectionGroup","url":"\/documentation\/brunow\/2015","abstract":[]},"doc://Brunow/documentation/Brunow":{"url":"\/documentation\/brunow","title":"Brunow","role":"collection","kind":"symbol","type":"topic","identifier":"doc:\/\/Brunow\/documentation\/Brunow","abstract":[{"type":"text","text":"David Brunow, known as Brunow [ˈbɹunoʊ] to the folks he works with, is a human living on Earth. You might have something in common with him — if you think it is ridiculous that he is talking about himself in the first person here, so does he."}]}}}