{"identifier":{"interfaceLanguage":"swift","url":"doc:\/\/Brunow\/documentation\/Brunow\/04-13-what-would-make-me-join-a-community"},"variants":[{"paths":["\/documentation\/brunow\/04-13-what-would-make-me-join-a-community"],"traits":[{"interfaceLanguage":"swift"}]}],"sections":[],"topicSectionsStyle":"detailedGrid","kind":"article","schemaVersion":{"patch":0,"major":0,"minor":3},"abstract":[{"text":"date: 2015-04-13T22:03:23-05:00","type":"text"}],"hierarchy":{"paths":[["doc:\/\/Brunow\/documentation\/Brunow","doc:\/\/Brunow\/documentation\/Brunow\/Archive","doc:\/\/Brunow\/documentation\/Brunow\/2015"]]},"primaryContentSections":[{"content":[{"type":"paragraph","inlineContent":[{"type":"text","text":"Early last week I attended a meeting of local techie, financial, and entrepreneurial types here in Denton for the first time. During that meeting I probably spoke out of turn, as I regularly do, and shared my opinions about the external view of that group and the fact that I wasn’t sure that I would attend another meeting. I said something along the lines of “we will all  decide whether it is worth our time to come to another one of these meetings and whether we get value out of them.”"}]},{"inlineContent":[{"type":"text","text":"As the last question of the meeting, Jack Kearney asked me what I would have had to have seen at that meeting for me to have no doubt about coming to the next one. I didn’t have an answer and told Jack that I’d think about it. Since the meeting I have thought at least a little about that question every day and I think I have an answer."}],"type":"paragraph"},{"type":"paragraph","inlineContent":[{"type":"text","text":"My answer is heavily influenced by what one of the ladies at the meeting (unfortunately I didn’t get her name) said on the topic of how to build a community. To paraphrase, she said that to build a community you get a really excited and engaged small group of people and then other people see that excitement and want to join and participate and the group keeps getting bigger that way."}]},{"type":"paragraph","inlineContent":[{"type":"text","text":"If that is what I had seen during that first meeting then I would definitely be attending the next. I picture walking into the coffee bar, seeing a group of people excitedly chatting about what’s going on with them (I know that in this particular group we have a number of introverts, but introverts get excited too!) and then being warmly welcomed by that group as if I’d been part of it for months already. I don’t care what the topics are as long as they engage the group and the group is excited and wants me to be a part of what they have going on."}]},{"type":"paragraph","inlineContent":[{"text":"That isn’t what I saw in that first meeting. What I did see was one member of the group working really hard to organize the meeting and come up with topics but without effort from the rest of the group. So am I going back for another meeting?","type":"text"}]},{"inlineContent":[{"text":"Yes! Why? Because I see a group of people that ","type":"text"},{"inlineContent":[{"text":"want","type":"text"}],"type":"emphasis"},{"type":"text","text":" to be excited and engaged but just need to be pushed a little further to get there. And because I see the future of what this group will do for our bigger community of Denton."}],"type":"paragraph"},{"inlineContent":[{"text":"I see the vision of why this group exists and I want to share that vision.","type":"text"}],"type":"paragraph"}],"kind":"content"}],"metadata":{"color":{"standardColorIdentifier":"purple"},"title":"What Would Make Me Join a Community","platforms":[{"name":"Brunow","introducedAt":"2017.01.20"}],"modules":[{"name":"Brunow"}]},"references":{"doc://Brunow/documentation/Brunow/Archive":{"kind":"article","role":"collectionGroup","abstract":[{"text":"All posts","type":"text"}],"url":"\/documentation\/brunow\/archive","type":"topic","title":"Archive","identifier":"doc:\/\/Brunow\/documentation\/Brunow\/Archive"},"doc://Brunow/documentation/Brunow/2015":{"title":"2015","role":"collectionGroup","abstract":[],"identifier":"doc:\/\/Brunow\/documentation\/Brunow\/2015","url":"\/documentation\/brunow\/2015","type":"topic","kind":"article"},"doc://Brunow/documentation/Brunow":{"url":"\/documentation\/brunow","title":"Brunow","kind":"symbol","type":"topic","role":"collection","identifier":"doc:\/\/Brunow\/documentation\/Brunow","abstract":[{"type":"text","text":"David Brunow, known as Brunow [ˈbɹunoʊ] to the folks he works with, is a human living on Earth. You might have something in common with him — if you think it is ridiculous that he is talking about himself in the first person here, so does he."}]}}}