{"primaryContentSections":[{"kind":"content","content":[{"type":"paragraph","inlineContent":[{"type":"text","text":"The last two days I talked about two different kinds of long term stress, the kind you just have to get through one step at a time and the kind you have to run away from because it is toxic. Today I’ll talk about the ways that I’ve tried to cope with those kinds of stress as well as short term stress."}]},{"anchor":"Get-Rest","level":2,"type":"heading","text":"Get Rest"},{"type":"paragraph","inlineContent":[{"type":"text","text":"Our natural tendency during stressful times is to sleep less. For short term stress, like waiting for lab results after your daughter had a seizure or taking care of your significant other when he has a high fever, cutting out sleep is the right reaction. Our bodies secrete the right hormones and hold back the wrong ones and prepare us perfectly for that situation."}]},{"type":"paragraph","inlineContent":[{"type":"text","text":"The problem comes when our body responds the same way during long term stress. We sleep less and try to fix the situation more, for months or even years. The less sleep we get the less well we handle our sleep deprivation. We lose brain function and we lose our humanity."}]},{"type":"paragraph","inlineContent":[{"type":"text","text":"When you are going through long term stress you must get your sleep. Cut out everything else first, although it’s really tough to do."}]},{"anchor":"Move","level":2,"type":"heading","text":"Move"},{"type":"paragraph","inlineContent":[{"type":"text","text":"Over a period of weeks and months those stress hormones will continue to build up in your body if you don’t move around to keep your bodily systems going. My natural response to work stress is to spend more time sitting at the computer and every moment away from it feels like a waste."}]},{"type":"paragraph","inlineContent":[{"type":"text","text":"It is not a waste, you must do it. But not at the expense of sleep."}]},{"anchor":"Quiet-the-Self-Talk","level":2,"type":"heading","text":"Quiet the Self Talk"},{"type":"paragraph","inlineContent":[{"type":"text","text":"That little voice in your head will be your biggest problem. It will be telling you that you aren’t working hard enough, that you aren’t smart enough, that you don’t deserve to be where you are. When you get your rest it will call you lazy. When you find time to move it will tell you you are wasting time."}]},{"type":"paragraph","inlineContent":[{"type":"text","text":"That little voice isn’t right. Listen for it but not to it. What I mean is pay attention to what it says and when it says something negative just let it go. Don’t fight it and don’t hold on to it. Just move on to the next thought or no thought at all."}]},{"anchor":"Find-a-Peaceful-Place","level":2,"type":"heading","text":"Find a Peaceful Place"},{"type":"paragraph","inlineContent":[{"type":"text","text":"Paying attention to those little thoughts in your head is a critical part of mindfulness. I practice mindfulness through a morning meditation habit and I highly encourage trying it. Meditation can be used for many things, but one of the main things I get out of it is noticing the thoughts that are going through my head."}]},{"type":"paragraph","inlineContent":[{"type":"text","text":"It is easy to get caught up in thoughts while doing mindless tasks like driving to work or taking a shower. You can easily spend a half hour and have no idea what you thought about. But if you are intentionally sitting and trying to not think about anything then the thoughts that show up stand out more. And by the way, it is fine if those thoughts show up, that doesn’t mean you’re doing meditation wrong. Just practice letting them go again."}]}]}],"schemaVersion":{"major":0,"minor":3,"patch":0},"sections":[],"variants":[{"paths":["\/documentation\/brunow\/05-04-how-i-handle-stress,-part-3"],"traits":[{"interfaceLanguage":"swift"}]}],"topicSectionsStyle":"detailedGrid","identifier":{"url":"doc:\/\/Brunow\/documentation\/Brunow\/05-04-how-i-handle-stress,-part-3","interfaceLanguage":"swift"},"abstract":[{"type":"text","text":"date: 2015-05-04T22:28:58-05:00"}],"kind":"article","metadata":{"platforms":[{"name":"Brunow","introducedAt":"2017.01.20"}],"color":{"standardColorIdentifier":"purple"},"title":"How I Handle Stress, Part 3","modules":[{"name":"Brunow"}]},"hierarchy":{"paths":[["doc:\/\/Brunow\/documentation\/Brunow","doc:\/\/Brunow\/documentation\/Brunow\/Archive","doc:\/\/Brunow\/documentation\/Brunow\/2015"]]},"references":{"doc://Brunow/documentation/Brunow/Archive":{"role":"collectionGroup","title":"Archive","abstract":[{"type":"text","text":"All posts"}],"identifier":"doc:\/\/Brunow\/documentation\/Brunow\/Archive","kind":"article","type":"topic","url":"\/documentation\/brunow\/archive"},"doc://Brunow/documentation/Brunow/2015":{"role":"collectionGroup","title":"2015","abstract":[],"identifier":"doc:\/\/Brunow\/documentation\/Brunow\/2015","kind":"article","type":"topic","url":"\/documentation\/brunow\/2015"},"doc://Brunow/documentation/Brunow":{"role":"collection","title":"Brunow","abstract":[{"type":"text","text":"David Brunow, known as Brunow [ˈbɹunoʊ] to the folks he works with, is a human living on Earth. You might have something in common with him — if you think it is ridiculous that he is talking about himself in the first person here, so does he."}],"identifier":"doc:\/\/Brunow\/documentation\/Brunow","kind":"symbol","type":"topic","url":"\/documentation\/brunow"}}}