{"primaryContentSections":[{"kind":"content","content":[{"type":"paragraph","inlineContent":[{"type":"text","text":"A couple of days ago a friend suggested that I write about how I handle stress. I initially thought “I have a lot of experience with that, that’s a great topic that should be easy to write about.” But the last couple of days I’ve been thinking about the stressful situations I’ve been in and I’ve struggled to take lessons away from them. I’ll try to stumble through the process of pulling out the lessons in this post."}]},{"type":"paragraph","inlineContent":[{"type":"text","text":"As I said, I have a lot of experience with stress: growing up in a household that felt like a constant battleground, going through my parents’ divorce, getting kicked out of both of my parents’ houses, failing enough classes in college to lose my full scholarship, foolishly creating mounds of credit card debt and getting bombarded by calls from bill collectors, getting laid off followed by months of unemployment and losing my car and getting evicted, struggling to make enough money to eat, basic training in the Army, being deployed to Iraq for a year with a super stressful highlight of a rocket flying through the wall of the room two down from mine, fighting to prove to Army medical staff that the herniated disc in my lower back was a serious injury, assimilating back into civilian society, finding out my daughter had hydrocephalus, living in a failing marriage, taking on too many responsibilities at work and failing, my daughter spending a month in the neonatal intensive care unit, and my daughter having a seizure."}]},{"type":"paragraph","inlineContent":[{"type":"text","text":"One effect of all those experiences is that stress affects me differently than an average person. I hit some pretty low lows early in my adulthood and everything else seems easy. But that isn’t to say that stress doesn’t affect me because it definitely does, but my initial reaction is to get calmer when everyone else panics. Looking back over those times I see different situations that have to be handled differently."}]},{"anchor":"Putting-One-Foot-in-Front-of-the-Other","level":2,"type":"heading","text":"Putting One Foot in Front of the Other"},{"type":"paragraph","inlineContent":[{"type":"text","text":"Many times you have no control over the source of the stress and no way to avoid it. You know it will end eventually but you have no way to stop it."}]},{"type":"paragraph","inlineContent":[{"type":"text","text":"My most vivid memory of viscerally feeling this kind of stress is of standing in the hallway after the rocket hit our barracks. I had been laying in bed, reading The Art Of War before going to sleep. Then all I heard was a really big bang. Luckily, it wasn’t an explosion but just a rocket going through the outside wall of our building and bouncing off the walls of a room two down from mine. Then silence. I opened the door and peered into the hallway at the same time as everyone in the surrounding rooms and we saw the rocket rolling on the floor in the middle of the hallway."}]},{"type":"paragraph","inlineContent":[{"type":"text","text":"We gathered downstairs while the bomb removal team took care of the rocket. I was severely shaken up. I had my arms wrapped around me — hugging myself — and my mind felt unstable. I don’t know a better way of explaining it than that. Then my mind came to a point where it examined the situation, weighed the options, and realized that I just had to carry on. I stuffed the experience down and locked it away. I just put one foot in front of the other, marching on."}]},{"type":"paragraph","inlineContent":[{"type":"text","text":"The only way to handle that kind of stress is to focus on the next step."}]},{"type":"paragraph","inlineContent":[{"type":"text","text":"This is a similar type of stress as college, where the best way to survive is to focus on the next class instead of the 30 you need to graduate. Like "},{"type":"reference","isActive":true,"identifier":"http:\/\/mobile.nytimes.com\/blogs\/takingnote\/2015\/03\/24\/kimmy-schmidts-revolutionary-approach-to-pain\/"},{"type":"text","text":", anyone can handle anything for ten seconds."}]},{"type":"paragraph","inlineContent":[{"type":"text","text":"Enduring these types of stress forge you — they make you who you are. I’ve endured long periods of this type of stress, and I think I was able to do so because I had the viewpoint of “that’s just the way it is.” Because things were out of my control, I was able to push them out of my mind and push myself forward. My recommendation is that if things are out of your control you should reconcile that early rather than wrestling with “if onlys” — if only I’d joined the Air Force instead of the Army, if only I were smarter, if only I wasn’t so bad at math."}]}]}],"schemaVersion":{"major":0,"minor":3,"patch":0},"sections":[],"variants":[{"paths":["\/documentation\/brunow\/05-02-how-i-handle-stress,-part-1"],"traits":[{"interfaceLanguage":"swift"}]}],"topicSectionsStyle":"detailedGrid","identifier":{"url":"doc:\/\/Brunow\/documentation\/Brunow\/05-02-how-i-handle-stress,-part-1","interfaceLanguage":"swift"},"abstract":[{"type":"text","text":"date: 2015-05-02T22:14:10-05:00"}],"kind":"article","metadata":{"platforms":[{"name":"Brunow","introducedAt":"2017.01.20"}],"color":{"standardColorIdentifier":"purple"},"title":"How I Handle Stress, Part 1","modules":[{"name":"Brunow"}]},"hierarchy":{"paths":[["doc:\/\/Brunow\/documentation\/Brunow","doc:\/\/Brunow\/documentation\/Brunow\/Archive","doc:\/\/Brunow\/documentation\/Brunow\/2015"]]},"references":{"doc://Brunow/documentation/Brunow":{"role":"collection","title":"Brunow","abstract":[{"type":"text","text":"David Brunow, known as Brunow [ˈbɹunoʊ] to the folks he works with, is a human living on Earth. You might have something in common with him — if you think it is ridiculous that he is talking about himself in the first person here, so does he."}],"identifier":"doc:\/\/Brunow\/documentation\/Brunow","kind":"symbol","type":"topic","url":"\/documentation\/brunow"},"doc://Brunow/documentation/Brunow/Archive":{"role":"collectionGroup","title":"Archive","abstract":[{"type":"text","text":"All posts"}],"identifier":"doc:\/\/Brunow\/documentation\/Brunow\/Archive","kind":"article","type":"topic","url":"\/documentation\/brunow\/archive"},"doc://Brunow/documentation/Brunow/2015":{"role":"collectionGroup","title":"2015","abstract":[],"identifier":"doc:\/\/Brunow\/documentation\/Brunow\/2015","kind":"article","type":"topic","url":"\/documentation\/brunow\/2015"},"http://mobile.nytimes.com/blogs/takingnote/2015/03/24/kimmy-schmidts-revolutionary-approach-to-pain/":{"title":"Kimmy Schmidt says","titleInlineContent":[{"type":"text","text":"Kimmy Schmidt says"}],"type":"link","identifier":"http:\/\/mobile.nytimes.com\/blogs\/takingnote\/2015\/03\/24\/kimmy-schmidts-revolutionary-approach-to-pain\/","url":"http:\/\/mobile.nytimes.com\/blogs\/takingnote\/2015\/03\/24\/kimmy-schmidts-revolutionary-approach-to-pain\/"}}}