{"schemaVersion":{"patch":0,"minor":3,"major":0},"abstract":[{"text":"date: 2013-05-07T18:59:22-05:00","type":"text"}],"metadata":{"title":"She’s Seizing","platforms":[{"introducedAt":"2017.01.20","name":"Brunow"}],"modules":[{"name":"Brunow"}],"color":{"standardColorIdentifier":"purple"}},"sections":[],"kind":"article","variants":[{"traits":[{"interfaceLanguage":"swift"}],"paths":["\/documentation\/brunow\/05-07-shes-seizing"]}],"identifier":{"interfaceLanguage":"swift","url":"doc:\/\/Brunow\/documentation\/Brunow\/05-07-shes-seizing"},"topicSectionsStyle":"detailedGrid","primaryContentSections":[{"kind":"content","content":[{"type":"paragraph","inlineContent":[{"type":"text","text":"Last Thursday night I didn’t sleep well. My heart was racing and I was restless most of the night. Then I felt “off” all day Friday. Didn’t know why."}]},{"type":"paragraph","inlineContent":[{"text":"On the way to pick up my daughter from my ex-wife’s house I was anxious and uncomfortable. For no known reason I had a feeling something bad would happen soon.","type":"text"}]},{"inlineContent":[{"type":"text","text":"I’d been driving for about 15 minutes with my daughter in her carseat in the back. She made a coughing\/gagging sound and I looked back at her. She looked like she was spitting up some mucous. Her body was limp against the straps of the seat. I sing-songed “Emma” with no response. I started saying the ABCs, one of her favorite things to say back to me. Still no response, only more gagging, more spit up."}],"type":"paragraph"},{"inlineContent":[{"type":"text","text":"I frantically found a place to pull over, put on the hazards, and got her out of the car. She slumped over on me and continued to cough and gag every few moments, spitting up on both of us. I held here there on the side of the road, hoping I could help her get out whatever was causing her sickness. Nothing more than that mucousy substance came out. She barely had the energy to contract her stomach to cough."}],"type":"paragraph"},{"type":"paragraph","inlineContent":[{"type":"text","text":"After a few minutes, I gave up on the idea of her coughing up whatever was bothering her and got her back in the car. It was only five minutes back home so I decided it would be better to get her comfortable and laying down there. I called her mother to see if she had been acting strangly at all that day — no, she’d been acting normally."}]},{"inlineContent":[{"type":"text","text":"I laid her down on the floor of my apartment, took off her clothes that she’d spit up on, and tried to comfort her. Her face was pale white and her lips had little color. She was breathing erratically. I was flipping out on the inside but tried to stay calm on the outside."}],"type":"paragraph"},{"type":"paragraph","inlineContent":[{"text":"Finally, she spit up more than just mucous. Finally, she started looking better. I sat down next to her and she looked up at me. She was more responsive than she had been since she started gagging in the car.","type":"text"}]},{"type":"paragraph","inlineContent":[{"text":"Then her left arm started moving rhythmically. Up and down, up and down, up and down. I didn’t want to believe that something was wrong — I wanted to believe that she was comforting herself through that rhythmic movement. Then her eyebrows started moving up and down, then her leg, then her tongue. I got her in the car to head to the ER.","type":"text"}]},{"type":"paragraph","inlineContent":[{"type":"text","text":"The drive to the ER felt like forever. Emma was limp in the backseat, her body moving beyond her control. When looking back at her at a light, I’d picture her smiling during bathtime — laying her back in the bathtub, with her hair floating above her head in the water. Then a snapshot of the enthusiasm with which she would look at me when I would start saying the ABCs came to the forefront. I almost lost it a few times. But I told myself “now is not the time for that.”"}]},{"type":"paragraph","inlineContent":[{"text":"I get her to the ER, out of the car as she slumps over, still rhythmically moving. They take her to the back, put her on a table and start stabilizing her. An insensitive tech is suddenly standing next to me and states “She’s seizing?” I don’t know what to say. “That’s what they’re saying” is what I come up with. My daughter is having a seizure. I almost lose it again. I almost lose it so many other times in that ER as the techs, nurses, and doctor work to stabilize her. They do.","type":"text"}]},{"inlineContent":[{"text":"Emma was taken to a Children’s hospital and spent the next day there. Through the haze of anti-seizure and anti-fever medication, my daughter started to come back. She talked a little. She drank some milk. She smiled.","type":"text"}],"type":"paragraph"},{"inlineContent":[{"text":"Emma is back to her normal self now. Her EEG showed that she had abnormal activity on the right side of her brain. We have no idea why the seizure happened or if anything triggered it, but the abnormal activity means that she’s more prone to future seizures than the average child. She’ll be taking anti-seizure medication twice a day for who knows how long. And like with everything else Emma has gone through, we’ll see how this all turns out down the road. It’s just one more unknown.","type":"text"}],"type":"paragraph"}]}],"hierarchy":{"paths":[["doc:\/\/Brunow\/documentation\/Brunow","doc:\/\/Brunow\/documentation\/Brunow\/Archive","doc:\/\/Brunow\/documentation\/Brunow\/2013"]]},"references":{"doc://Brunow/documentation/Brunow/Archive":{"identifier":"doc:\/\/Brunow\/documentation\/Brunow\/Archive","type":"topic","kind":"article","abstract":[{"type":"text","text":"All posts"}],"role":"collectionGroup","title":"Archive","url":"\/documentation\/brunow\/archive"},"doc://Brunow/documentation/Brunow/2013":{"title":"2013","url":"\/documentation\/brunow\/2013","abstract":[],"identifier":"doc:\/\/Brunow\/documentation\/Brunow\/2013","type":"topic","kind":"article","role":"collectionGroup"},"doc://Brunow/documentation/Brunow":{"type":"topic","title":"Brunow","role":"collection","url":"\/documentation\/brunow","kind":"symbol","abstract":[{"type":"text","text":"David Brunow, known as Brunow [ˈbɹunoʊ] to the folks he works with, is a human living on Earth. You might have something in common with him — if you think it is ridiculous that he is talking about himself in the first person here, so does he."}],"identifier":"doc:\/\/Brunow\/documentation\/Brunow"}}}