{"abstract":[{"type":"text","text":"date: 2015-05-10T00:05:03-05:00"}],"primaryContentSections":[{"content":[{"type":"paragraph","inlineContent":[{"type":"text","text":"My third rule for making things is all about making it easy to work with other people, whether you will actually be doing so or not. This rule is less about using tools and more about putting good processes in place, but I won’t be getting into the details of those specific processes because they will differ by team. The important takeaway is that you should be thinking about those processes."}]},{"type":"heading","level":2,"anchor":"Step-3-Enable-Collaboration","text":"Step 3 — Enable Collaboration"},{"items":[{"content":[{"type":"paragraph","inlineContent":[{"text":"Be able to integrate multiple changes seamlessly — This is critical to building quality software and to maintaining momentum. Without a good way to integrate changes, people will not merge their changes in a timely manner, changes will get lost, and you’ll find that the things you’ve already fixed are broken again. Not having that good way to integrate changes causes extra work and energy to be expended on tasks a computer should be doing, so your team will be spending time on that frustrating task rather than on the fun task of building cool new things. You’ll get less work done in the same amount of time and your team will be angrier.","type":"text"}]},{"inlineContent":[{"type":"text","text":"We use Git to make our change integrations simple."}],"type":"paragraph"}]},{"content":[{"type":"paragraph","inlineContent":[{"text":"Make communication clear and open for everyone involved — The biggest hindrance to getting people to join in on a project is having to tell them all the background information about it. This can be limited by openly sharing all the information about every project so everyone on the team has a baseline understanding of what is going on. As a side effect, this improves morale.","type":"text"}]},{"inlineContent":[{"type":"text","text":"Slack is the tool we use for this."}],"type":"paragraph"}]},{"content":[{"inlineContent":[{"type":"text","text":"Use as few and as simple of tools as possible — Everyone on your team should be able to join in on a project without having to install any new tools. The best way to ensure this is to limit the tools you use and keep them simple."}],"type":"paragraph"}]},{"content":[{"inlineContent":[{"text":"Make it as easy as possible to add a new person to a project as possible (even if you have no intention of doing so) — This has two benefits. First, if you are running close to a deadline and need someone to help out quickly they can hop in without slowing you down. Second, making it easy for others to join in also generally leads to a solution that makes it easier for you to start over if you need, like if you want to move an entire project to a new computer or new server.","type":"text"}],"type":"paragraph"}]},{"content":[{"type":"paragraph","inlineContent":[{"type":"text","text":"Reduce bottlenecks (don’t have one person be the only person for anything) — Having a bottleneck can kill the momentum you have tried so hard to build on a project and gives that bottleneck person one more thing to worry about when they are already falling behind. Don’t do that to them."}]}]}],"type":"orderedList"}],"kind":"content"}],"metadata":{"color":{"standardColorIdentifier":"purple"},"title":"My Rules for Making Things, Part 3","modules":[{"name":"Brunow"}],"platforms":[{"name":"Brunow","introducedAt":"2017.01.20"}]},"kind":"article","topicSectionsStyle":"detailedGrid","schemaVersion":{"patch":0,"major":0,"minor":3},"hierarchy":{"paths":[["doc:\/\/Brunow\/documentation\/Brunow","doc:\/\/Brunow\/documentation\/Brunow\/Archive","doc:\/\/Brunow\/documentation\/Brunow\/2015"]]},"variants":[{"traits":[{"interfaceLanguage":"swift"}],"paths":["\/documentation\/brunow\/05-10-my-rules-for-making-things,-part-3"]}],"identifier":{"url":"doc:\/\/Brunow\/documentation\/Brunow\/05-10-my-rules-for-making-things,-part-3","interfaceLanguage":"swift"},"sections":[],"references":{"doc://Brunow/documentation/Brunow":{"url":"\/documentation\/brunow","role":"collection","identifier":"doc:\/\/Brunow\/documentation\/Brunow","kind":"symbol","abstract":[{"text":"David Brunow, known as Brunow [ˈbɹunoʊ] to the folks he works with, is a human living on Earth. You might have something in common with him — if you think it is ridiculous that he is talking about himself in the first person here, so does he.","type":"text"}],"type":"topic","title":"Brunow"},"doc://Brunow/documentation/Brunow/2015":{"abstract":[],"role":"collectionGroup","type":"topic","url":"\/documentation\/brunow\/2015","kind":"article","identifier":"doc:\/\/Brunow\/documentation\/Brunow\/2015","title":"2015"},"doc://Brunow/documentation/Brunow/Archive":{"role":"collectionGroup","abstract":[{"type":"text","text":"All posts"}],"title":"Archive","identifier":"doc:\/\/Brunow\/documentation\/Brunow\/Archive","type":"topic","kind":"article","url":"\/documentation\/brunow\/archive"}}}