{"topicSectionsStyle":"detailedGrid","abstract":[{"type":"text","text":"date: 2016-05-19T22:39:10-05:00"}],"primaryContentSections":[{"kind":"content","content":[{"type":"paragraph","inlineContent":[{"type":"text","text":"Today I’ll continue the discussion I started yesterday about that moment after I’ve had an idea that I think is great. In that moment I ask myself “Why hasn’t this been done before?” One answer to that question is “Actually, it has been done before but it failed” so I’ll discuss how I handle that possibility. I think it’s important that I note here that I’m asking this question to determine whether I can turn my idea into a sustainable project and business. If you only care about making something you are fired up about then this question won’t matter to you."}]},{"type":"paragraph","inlineContent":[{"text":"The keys to handling this situation are research and finding root causes. I need to learn as much as possible about the previous attempts to do this thing. From that research I need to put together the facts to figure out why it failed. Most businesses fail because they run out of money but that isn’t helpful information here. I need to know ","type":"text"},{"type":"emphasis","inlineContent":[{"text":"why","type":"text"}]},{"type":"text","text":" they ran out of money. I’ll also be tempted to blame the incompetence of the people who were trying to do this the first time. I’ll tell myself that I won’t be so dumb and make the mistakes they did. But again, that isn’t the root cause and, as a side note, I will make incompetent mistakes too although they may be different ones."}]},{"inlineContent":[{"type":"text","text":"Ultimately the root cause should fall into one of two broad categories — the previous effort either went in unprepared, with too little cash or experience or talent or all three, or their target market didn’t care about their thing as much as they anticipated. After finding one of those root causes I have to ask myself “can I bring somethings to this that will avoid that problem?” Hopefully the answer is yes. Then that is the beginning of the slog to actually follow through and prove it."}],"type":"paragraph"}]}],"variants":[{"traits":[{"interfaceLanguage":"swift"}],"paths":["\/documentation\/brunow\/05-19-it-has-been-done-before-but-it-failed"]}],"metadata":{"modules":[{"name":"Brunow"}],"platforms":[{"name":"Brunow","introducedAt":"2017.01.20"}],"title":"It Has Been Done Before But It Failed","color":{"standardColorIdentifier":"purple"}},"kind":"article","sections":[],"identifier":{"url":"doc:\/\/Brunow\/documentation\/Brunow\/05-19-it-has-been-done-before-but-it-failed","interfaceLanguage":"swift"},"hierarchy":{"paths":[["doc:\/\/Brunow\/documentation\/Brunow","doc:\/\/Brunow\/documentation\/Brunow\/Archive","doc:\/\/Brunow\/documentation\/Brunow\/2016"]]},"schemaVersion":{"patch":0,"minor":3,"major":0},"references":{"doc://Brunow/documentation/Brunow/2016":{"kind":"article","identifier":"doc:\/\/Brunow\/documentation\/Brunow\/2016","title":"2016","role":"collectionGroup","abstract":[],"type":"topic","url":"\/documentation\/brunow\/2016"},"doc://Brunow/documentation/Brunow/Archive":{"url":"\/documentation\/brunow\/archive","kind":"article","identifier":"doc:\/\/Brunow\/documentation\/Brunow\/Archive","title":"Archive","type":"topic","abstract":[{"type":"text","text":"All posts"}],"role":"collectionGroup"},"doc://Brunow/documentation/Brunow":{"identifier":"doc:\/\/Brunow\/documentation\/Brunow","abstract":[{"type":"text","text":"David Brunow, known as Brunow [ˈbɹunoʊ] to the folks he works with, is a human living on Earth. You might have something in common with him — if you think it is ridiculous that he is talking about himself in the first person here, so does he."}],"title":"Brunow","role":"collection","type":"topic","kind":"symbol","url":"\/documentation\/brunow"}}}