{"abstract":[{"type":"text","text":"date: 2015-05-19T00:05:09-05:00"}],"metadata":{"color":{"standardColorIdentifier":"purple"},"platforms":[{"introducedAt":"2017.01.20","name":"Brunow"}],"modules":[{"name":"Brunow"}],"title":"Inside the Frame"},"sections":[],"schemaVersion":{"patch":0,"major":0,"minor":3},"kind":"article","hierarchy":{"paths":[["doc:\/\/Brunow\/documentation\/Brunow","doc:\/\/Brunow\/documentation\/Brunow\/Archive","doc:\/\/Brunow\/documentation\/Brunow\/2015"]]},"identifier":{"url":"doc:\/\/Brunow\/documentation\/Brunow\/05-19-inside-the-frame","interfaceLanguage":"swift"},"topicSectionsStyle":"detailedGrid","primaryContentSections":[{"kind":"content","content":[{"inlineContent":[{"type":"text","text":"I’ve started getting into the basics of photography and shooting video and I’ve noticed something that is probably obvious to most people — in many cases what you see in the frame only shows a fraction of the work being put in to make something of quality."}],"type":"paragraph"},{"type":"paragraph","inlineContent":[{"type":"text","text":"For an example, I was recently shooting some pictures for a website we are working on. I’d found a picture that had a “feel” that I liked but the cost to license it was beyond our budget. So I staged a similar scene with two qualities in mind, brightness and calm. I think the pictures turned out great, and because viewers can only see what is in the frame, they won’t ever know that I was standing on a metal folding chair over a massage table in the corner of our office crammed less than a foot away from my desk next to a window with the morning sun coming through. They will see brightness and calm."}]},{"inlineContent":[{"text":"The same is true for shooting videos with quality audio — the microphone must be within a foot to a foot and a half from the speaker’s mouth but no one wants unsightly microphones in the video shot. So you either put it on a stand or have someone to hold it outside of the camera frame. Until recently I didn’t think about all this effort that went into getting good quality sound in a shot.","type":"text"}],"type":"paragraph"},{"type":"paragraph","inlineContent":[{"type":"text","text":"This applies to how you see others’ lives also. "},{"type":"reference","identifier":"https:\/\/vimeo.com\/78591456","isActive":true},{"type":"text","text":", you usually only see other peoples’ highlight reel and their finished products. Their hard work and trying times are outside the frame and it is so easy to forget about them. In some cases people do this intentionally — they build up a different view of themselves for the world and most of the world doesn’t dig deeply enough to see the truth. But in most cases it is just not feasible to show all the hard work and tough decisions — can you imagine a realistic rendition of the training from Rocky? You’d be watching a man wake up at the crack of dawn and run and lift weights and train hundreds of times in a row. I’d appreciate the realism but there is no way I’d sit through that."}]},{"inlineContent":[{"type":"text","text":"So after all this rambling, what am I trying to say?"}],"type":"paragraph"},{"inlineContent":[{"type":"text","text":"First, if you put up a façade of who you are then you will probably fool most people because they don’t dig deeply. Unfortunately, the ones that do dig deeply are generally the ones who care and will be disappointed in your inauthentic story."}],"type":"paragraph"},{"type":"paragraph","inlineContent":[{"text":"Second, for everything you see that you like in this world, remember the massive amount of work that went into creating it. And remember that you will need to put in a similar amount of thankless work to create your great thing.","type":"text"}]}]}],"variants":[{"paths":["\/documentation\/brunow\/05-19-inside-the-frame"],"traits":[{"interfaceLanguage":"swift"}]}],"references":{"doc://Brunow/documentation/Brunow/2015":{"title":"2015","url":"\/documentation\/brunow\/2015","kind":"article","identifier":"doc:\/\/Brunow\/documentation\/Brunow\/2015","type":"topic","role":"collectionGroup","abstract":[]},"doc://Brunow/documentation/Brunow":{"title":"Brunow","kind":"symbol","url":"\/documentation\/brunow","identifier":"doc:\/\/Brunow\/documentation\/Brunow","abstract":[{"type":"text","text":"David Brunow, known as Brunow [ˈbɹunoʊ] to the folks he works with, is a human living on Earth. You might have something in common with him — if you think it is ridiculous that he is talking about himself in the first person here, so does he."}],"role":"collection","type":"topic"},"https://vimeo.com/78591456":{"title":"Like others have said better than I can","titleInlineContent":[{"text":"Like others have said better than I can","type":"text"}],"type":"link","url":"https:\/\/vimeo.com\/78591456","identifier":"https:\/\/vimeo.com\/78591456"},"doc://Brunow/documentation/Brunow/Archive":{"title":"Archive","role":"collectionGroup","abstract":[{"text":"All posts","type":"text"}],"identifier":"doc:\/\/Brunow\/documentation\/Brunow\/Archive","kind":"article","url":"\/documentation\/brunow\/archive","type":"topic"}}}