{"identifier":{"interfaceLanguage":"swift","url":"doc:\/\/Brunow\/documentation\/Brunow\/06-05-choosing-the-right-thing"},"primaryContentSections":[{"content":[{"inlineContent":[{"text":"I don’t think us humans are good at making choices when any level of ambiguity or unknowns are involved. Take hiring a new employee as an example. The likelihood of finding the right person is a function of how clear the requirements for the position are and how much you know about each candidate. In most hiring situations I’ve been around the job is poorly defined and the only information you have about the candidate is what they have told you through their resume, cover letter, and a series of interviews. This is a situation where both parties need much more data to make a good decision. The amount of data is far beyond what you can get from doubling the number of interviews. You need to know what it is like to work with that person every day. She needs to know what her real job is and what her coworkers will be like to work with every day. Thousands if not hundreds of thousands of additional data points are needed. But they have to be the right data points. We don’t need to take her on a corporate retreat to see how she’d fit in (unless frequent corporate retreats are part of the job). We need relevant data. All the data in the world would actually make things harder to use because we can’t easily know which parts are relevant. The data we need is specific to our applicant, our people, our company, and the position we need.","type":"text"}],"type":"paragraph"},{"type":"paragraph","inlineContent":[{"text":"This job applicant example was an easy one for me to come up with but I’m sure it isn’t the only situation where the same factors apply. How can you apply the same idea to your problems that don’t have great solutions?","type":"text"}]}],"kind":"content"}],"topicSectionsStyle":"detailedGrid","sections":[],"metadata":{"title":"Choosing The Right Thing","modules":[{"name":"Brunow"}],"platforms":[{"name":"Brunow","introducedAt":"2017.01.20"}],"color":{"standardColorIdentifier":"purple"}},"variants":[{"traits":[{"interfaceLanguage":"swift"}],"paths":["\/documentation\/brunow\/06-05-choosing-the-right-thing"]}],"kind":"article","abstract":[{"text":"date: 2016-06-04T12:59:29-05:00","type":"text"}],"schemaVersion":{"minor":3,"patch":0,"major":0},"hierarchy":{"paths":[["doc:\/\/Brunow\/documentation\/Brunow","doc:\/\/Brunow\/documentation\/Brunow\/Archive","doc:\/\/Brunow\/documentation\/Brunow\/2016"]]},"references":{"doc://Brunow/documentation/Brunow/2016":{"kind":"article","type":"topic","identifier":"doc:\/\/Brunow\/documentation\/Brunow\/2016","url":"\/documentation\/brunow\/2016","abstract":[],"role":"collectionGroup","title":"2016"},"doc://Brunow/documentation/Brunow":{"identifier":"doc:\/\/Brunow\/documentation\/Brunow","kind":"symbol","url":"\/documentation\/brunow","title":"Brunow","type":"topic","abstract":[{"text":"David Brunow, known as Brunow [ˈbɹunoʊ] to the folks he works with, is a human living on Earth. You might have something in common with him — if you think it is ridiculous that he is talking about himself in the first person here, so does he.","type":"text"}],"role":"collection"},"doc://Brunow/documentation/Brunow/Archive":{"identifier":"doc:\/\/Brunow\/documentation\/Brunow\/Archive","url":"\/documentation\/brunow\/archive","title":"Archive","kind":"article","abstract":[{"text":"All posts","type":"text"}],"type":"topic","role":"collectionGroup"}}}