{"metadata":{"title":"The Feeling of Being Had","color":{"standardColorIdentifier":"purple"},"platforms":[{"introducedAt":"2017.01.20","name":"Brunow"}],"modules":[{"name":"Brunow"}]},"topicSectionsStyle":"detailedGrid","identifier":{"interfaceLanguage":"swift","url":"doc:\/\/Brunow\/documentation\/Brunow\/06-19-the-feeling-of-being-had"},"primaryContentSections":[{"content":[{"inlineContent":[{"text":"I’m a very trusting person. I believe you don’t need a contract where a handshake will do and if something goes wrong I’ll give you the benefit of the doubt that it isn’t your fault.","type":"text"}],"type":"paragraph"},{"type":"paragraph","inlineContent":[{"text":"But despite my trusting attitude, being in a situation where I feel like someone is taking advantage of me is awful. I can easily see why people inherently distrust — simply to avoid that feeling.","type":"text"}]},{"type":"paragraph","inlineContent":[{"text":"But inherent starts one of those vicious cycles. The situation you’re in worries you a little so you start thinking you can’t trust the person. The fear and other negative voices in your head start screaming at you that you’re doing something dumb and that you’re dumb for it and that you are a sucker. It’s a truly awful feeling that will take your feet out from under you. So you back out of the situation you’re in. You don’t have all the facts but backing out feels safer and smarter.","type":"text"}]},{"inlineContent":[{"text":"Then your mind goes to work to rationalize your decision. The stories you tell yourself and others change and you become the hero of them — the smart hero that saw what the evil person was doing to try to take advantage of your generosity. You repeat this story to yourself and to those you care about. The fear spreads and the cycle continues. The next time your friend is in a situation where she is feeling the same things she will remember your story and  the cycle continues, the fear spreading like a virus.","type":"text"}],"type":"paragraph"},{"type":"paragraph","inlineContent":[{"text":"Meanwhile, in the real world you backed out of a situation that scared you but in which other the person intended no harm. She was just living her life and doing her thing and then something she did spooked you. She wasn’t out to get you. She didn’t want to steal from you or cause harm. She was just reacting to the changing events in her life. You will never know this, of course, and you will never know any benefits that might have come out of working through that situation.","type":"text"}]},{"inlineContent":[{"type":"text","text":"I encourage you to sit with that awful feeling a little longer than you want to. Let it wash over you. Don’t react. Just sit, feel, and absorb. Let it pass. And once it passes, gather whatever information you need, and make a decision."}],"type":"paragraph"}],"kind":"content"}],"kind":"article","schemaVersion":{"minor":3,"patch":0,"major":0},"hierarchy":{"paths":[["doc:\/\/Brunow\/documentation\/Brunow","doc:\/\/Brunow\/documentation\/Brunow\/Archive","doc:\/\/Brunow\/documentation\/Brunow\/2015"]]},"abstract":[{"type":"text","text":"date: 2015-06-19T22:55:33-05:00"}],"variants":[{"paths":["\/documentation\/brunow\/06-19-the-feeling-of-being-had"],"traits":[{"interfaceLanguage":"swift"}]}],"sections":[],"references":{"doc://Brunow/documentation/Brunow/Archive":{"url":"\/documentation\/brunow\/archive","kind":"article","role":"collectionGroup","title":"Archive","type":"topic","identifier":"doc:\/\/Brunow\/documentation\/Brunow\/Archive","abstract":[{"type":"text","text":"All posts"}]},"doc://Brunow/documentation/Brunow/2015":{"identifier":"doc:\/\/Brunow\/documentation\/Brunow\/2015","abstract":[],"role":"collectionGroup","kind":"article","type":"topic","url":"\/documentation\/brunow\/2015","title":"2015"},"doc://Brunow/documentation/Brunow":{"type":"topic","role":"collection","identifier":"doc:\/\/Brunow\/documentation\/Brunow","abstract":[{"type":"text","text":"David Brunow, known as Brunow [ˈbɹunoʊ] to the folks he works with, is a human living on Earth. You might have something in common with him — if you think it is ridiculous that he is talking about himself in the first person here, so does he."}],"title":"Brunow","kind":"symbol","url":"\/documentation\/brunow"}}}