{"primaryContentSections":[{"kind":"content","content":[{"type":"paragraph","inlineContent":[{"type":"text","text":"I’m going to talk about something more technical today that may be outside what many people will find useful. I create a lot of software projects from scratch. As a consultant I get brought in to create a thing that hasn’t existed before and make it happen. Generally I go through this process shortly after the requirements have been outlined and before they’ve been fully defined. I’m good at handling situations with ambiguity which really helps when the client either doesn’t know or can’t express exactly what she wants."}]},{"type":"paragraph","inlineContent":[{"type":"text","text":"During this process I try to keep everything as flexible as possible. This means quick iterations on items and not handling every special case during the first round. The first round of code is partially exploratory as we see what works and doesn’t once we hold it in our hand. This first round is one of a few rounds, each of which further hardens the code into something stable."}]},{"type":"paragraph","inlineContent":[{"type":"text","text":"But in the early phases the code must remain malleable. For that reason I won’t handle every possible error condition or write tests in the early phases. That effort could be wasted in more than one way. First, we may decide that the feature isn’t necessary anyway and throw it out. Second, the more I build around the first phase of code the more invested in it I’ll feel and the less likely I am to remove something that isn’t working right. It isn’t rational, but I’ll feel like I’ve wasted the effort and remember how much I put into it and that will discourage me from taking actions I need to take."}]},{"type":"paragraph","inlineContent":[{"type":"text","text":"I’ve never blacksmithed before, but I’m guessing the way I build an app is similar to how a blacksmith makes a sword — keeping it fluid and malleable in the early stages and making it harder and stronger with each subsequent pass."}]}]}],"schemaVersion":{"major":0,"minor":3,"patch":0},"sections":[],"variants":[{"paths":["\/documentation\/brunow\/06-27-flexible-code"],"traits":[{"interfaceLanguage":"swift"}]}],"topicSectionsStyle":"detailedGrid","identifier":{"url":"doc:\/\/Brunow\/documentation\/Brunow\/06-27-flexible-code","interfaceLanguage":"swift"},"abstract":[{"type":"text","text":"date: 2016-06-27T22:55:59-05:00"}],"kind":"article","metadata":{"platforms":[{"name":"Brunow","introducedAt":"2017.01.20"}],"color":{"standardColorIdentifier":"purple"},"title":"Flexible Code","modules":[{"name":"Brunow"}]},"hierarchy":{"paths":[["doc:\/\/Brunow\/documentation\/Brunow","doc:\/\/Brunow\/documentation\/Brunow\/Archive","doc:\/\/Brunow\/documentation\/Brunow\/2016"]]},"references":{"doc://Brunow/documentation/Brunow/Archive":{"role":"collectionGroup","title":"Archive","abstract":[{"type":"text","text":"All posts"}],"identifier":"doc:\/\/Brunow\/documentation\/Brunow\/Archive","kind":"article","type":"topic","url":"\/documentation\/brunow\/archive"},"doc://Brunow/documentation/Brunow":{"role":"collection","title":"Brunow","abstract":[{"type":"text","text":"David Brunow, known as Brunow [ˈbɹunoʊ] to the folks he works with, is a human living on Earth. You might have something in common with him — if you think it is ridiculous that he is talking about himself in the first person here, so does he."}],"identifier":"doc:\/\/Brunow\/documentation\/Brunow","kind":"symbol","type":"topic","url":"\/documentation\/brunow"},"doc://Brunow/documentation/Brunow/2016":{"role":"collectionGroup","title":"2016","abstract":[],"identifier":"doc:\/\/Brunow\/documentation\/Brunow\/2016","kind":"article","type":"topic","url":"\/documentation\/brunow\/2016"}}}