{"schemaVersion":{"patch":0,"major":0,"minor":3},"sections":[],"topicSectionsStyle":"detailedGrid","primaryContentSections":[{"kind":"content","content":[{"inlineContent":[{"type":"text","text":"I picked up a prescription tonight and had to wait inside a drug store for 15-20 minutes. Being inside a drugstore is a rare occurrence and it is even more rare that I’m there and wandering around without a specific purpose — that isn’t a way I spend my time. But I was there and I walked around the store and looked at what they had on the shelves. And those things on the shelves made me wonder about the value of knowing what’s on the shelves."}],"type":"paragraph"},{"type":"paragraph","inlineContent":[{"text":"What information can I get from the things they have in stock, where they are located in the store, and how many they have on the shelves? Is that information useful in anyway or could it only lead to false conclusions? Is it useful data or just more clutter?","type":"text"}]},{"type":"paragraph","inlineContent":[{"text":"The store had several shelves for toy cars, small versions of real cars rather than imaginary cars. Amongst those toy cars was a high percentage of Aston Martins — I didn’t count but probably 20-30% of them were Astons. I find this strange because Astons are a particularly fast car or good car in terms of high performance cars. And I didn’t see any of what I would call good high performance cars there like Porsches or Ferraris. So why were there so many Astons? I can’t tell without more information. It could be that they sell a lot of the Astons at that store. Or maybe they sell a lot of them on average over all the stores. Or maybe the creator of the Aston toys pays more money for shelf placement and so they bought that ratio. Or maybe I saw so many because Astons don’t sell as well as the others.","type":"text"}]},{"inlineContent":[{"type":"text","text":"Obviously I don’t have enough information to change what I perceived from mere information to real data. But that doesn’t mean the information itself isn’t useful because our brains are built to find connections. Each new thing we learn get organized with everything else we know and tested for logical accuracy. So each new piece of information can possibly spur something we can’t imagine now."}],"type":"paragraph"}]}],"kind":"article","metadata":{"modules":[{"name":"Brunow"}],"color":{"standardColorIdentifier":"purple"},"title":"Useful Information","platforms":[{"name":"Brunow","introducedAt":"2017.01.20"}]},"variants":[{"paths":["\/documentation\/brunow\/07-12-useful-information"],"traits":[{"interfaceLanguage":"swift"}]}],"abstract":[{"type":"text","text":"date: 2016-07-12T00:14:10-05:00"}],"hierarchy":{"paths":[["doc:\/\/Brunow\/documentation\/Brunow","doc:\/\/Brunow\/documentation\/Brunow\/Archive","doc:\/\/Brunow\/documentation\/Brunow\/2016"]]},"identifier":{"interfaceLanguage":"swift","url":"doc:\/\/Brunow\/documentation\/Brunow\/07-12-useful-information"},"references":{"doc://Brunow/documentation/Brunow/Archive":{"kind":"article","title":"Archive","identifier":"doc:\/\/Brunow\/documentation\/Brunow\/Archive","type":"topic","abstract":[{"text":"All posts","type":"text"}],"role":"collectionGroup","url":"\/documentation\/brunow\/archive"},"doc://Brunow/documentation/Brunow":{"title":"Brunow","type":"topic","url":"\/documentation\/brunow","role":"collection","abstract":[{"type":"text","text":"David Brunow, known as Brunow [ˈbɹunoʊ] to the folks he works with, is a human living on Earth. You might have something in common with him — if you think it is ridiculous that he is talking about himself in the first person here, so does he."}],"identifier":"doc:\/\/Brunow\/documentation\/Brunow","kind":"symbol"},"doc://Brunow/documentation/Brunow/2016":{"identifier":"doc:\/\/Brunow\/documentation\/Brunow\/2016","role":"collectionGroup","title":"2016","type":"topic","abstract":[],"kind":"article","url":"\/documentation\/brunow\/2016"}}}