{"hierarchy":{"paths":[["doc:\/\/Brunow\/documentation\/Brunow","doc:\/\/Brunow\/documentation\/Brunow\/Archive","doc:\/\/Brunow\/documentation\/Brunow\/2015"]]},"schemaVersion":{"patch":0,"minor":3,"major":0},"topicSectionsStyle":"detailedGrid","primaryContentSections":[{"kind":"content","content":[{"type":"paragraph","inlineContent":[{"type":"text","text":"The last couple of days I’ve been discussing the idea of aligning your incentives to those over your clients as a business providing services to another businesses. I’ve focused on pricing models because the primary, and most easily defined, incentive in these relationships is money. So far I’ve covered hourly billing and project based billing, and today I’ll talk about retainer based billing."}]},{"level":3,"anchor":"Retainer-Based-Billing","text":"Retainer Based Billing","type":"heading"},{"type":"paragraph","inlineContent":[{"text":"In the kind of work I’ve done, retainer based billing is a specialty tool only good for certain situations, like a plumbing key that is only good for opening a sewer cover. I’d love to find a way to make it work for projects because it makes some things much simpler, but I haven’t been able to come up with a way to do that yet.","type":"text"}]},{"type":"paragraph","inlineContent":[{"text":"In retainer based pricing, your clients pay you an agreed upon amount of money each month to ensure that you’ll be available for them for a certain amount of time that month. No matter how much work you do that month, you get the same amount of money.","type":"text"}]},{"type":"paragraph","inlineContent":[{"text":"As with project based billing, your client’s incentive is to get as much out of your for that monthly amount as possible. It is good to set their expectations right so that they don’t feel like they aren’t getting what they are paying for, so specify specific amounts of your time that they get per month or certain standards that you’ll meet.","type":"text"}]},{"inlineContent":[{"text":"Your incentive is to spend as little time as possible providing these services for your client which should lead to you doing your best to get things right the first time. Let’s consider two scenarios in which a local book store is having issues with their wireless networking.","type":"text"}],"type":"paragraph"},{"type":"paragraph","inlineContent":[{"type":"text","text":"In scenario 1, the book store is paying a company to send out technicians to look at the networking problem and charging by the hour. That technician has no incentive to get the work done right the first time because each time she goes out there she gets more billable hours. She’s probably great at her job and will get it fixed quickly and accurately the first time, but that isn’t always the case."}]},{"inlineContent":[{"text":"In scenario 2, the book store is paying a company to “make sure their network is working right.” They pay the same amount every month regardless of whether a technician has to come out. The company providing that service now has the incentive to do two things that benefit the client: 1) get the network working as quickly as possible if it has issues and 2) hire people that are really good at their job to ensure they get it done in as few hours as possible. Both of those are great for the book store because they need that network up to run their business.","type":"text"}],"type":"paragraph"},{"type":"paragraph","inlineContent":[{"text":"Retainer based billing also makes invoicing simpler for both sides. Your company sends the same invoice every month. They only have to quickly review it to make sure nothing has changed, rather than go through each line item to make sure it looks right.","type":"text"}]},{"inlineContent":[{"type":"text","text":"I really like the idea of retainer based billing, but like I said before it only works for a small set of situations. But if you can setup some of those situations you can get a nice steady baseline of cash flowing into your business every month that helps to smooth out the fluctuations you’ll get from your hourly and project based work."}],"type":"paragraph"}]}],"metadata":{"platforms":[{"introducedAt":"2017.01.20","name":"Brunow"}],"title":"Aligning Incentives, Part 3","modules":[{"name":"Brunow"}],"color":{"standardColorIdentifier":"purple"}},"abstract":[{"text":"date: 2015-08-13T07:58:30-05:00","type":"text"}],"variants":[{"traits":[{"interfaceLanguage":"swift"}],"paths":["\/documentation\/brunow\/08-13-aligning-incentives,-part-3"]}],"identifier":{"url":"doc:\/\/Brunow\/documentation\/Brunow\/08-13-aligning-incentives,-part-3","interfaceLanguage":"swift"},"sections":[],"kind":"article","references":{"doc://Brunow/documentation/Brunow":{"identifier":"doc:\/\/Brunow\/documentation\/Brunow","kind":"symbol","url":"\/documentation\/brunow","title":"Brunow","type":"topic","abstract":[{"text":"David Brunow, known as Brunow [ˈbɹunoʊ] to the folks he works with, is a human living on Earth. You might have something in common with him — if you think it is ridiculous that he is talking about himself in the first person here, so does he.","type":"text"}],"role":"collection"},"doc://Brunow/documentation/Brunow/2015":{"title":"2015","type":"topic","identifier":"doc:\/\/Brunow\/documentation\/Brunow\/2015","abstract":[],"role":"collectionGroup","url":"\/documentation\/brunow\/2015","kind":"article"},"doc://Brunow/documentation/Brunow/Archive":{"identifier":"doc:\/\/Brunow\/documentation\/Brunow\/Archive","url":"\/documentation\/brunow\/archive","title":"Archive","kind":"article","abstract":[{"text":"All posts","type":"text"}],"type":"topic","role":"collectionGroup"}}}