{"topicSectionsStyle":"detailedGrid","sections":[],"variants":[{"traits":[{"interfaceLanguage":"swift"}],"paths":["\/documentation\/brunow\/08-27-wordpress-vs-bootstrap"]}],"schemaVersion":{"minor":3,"major":0,"patch":0},"kind":"article","primaryContentSections":[{"kind":"content","content":[{"type":"paragraph","inlineContent":[{"type":"text","text":"The technology world is full of lingo that most people don’t understand. As a bilingual need — one that can speak both technology and human — I try to do what I can to fix that. For example, I answered a question today that I thought I’d share here, with some paraphrasing:"}]},{"type":"paragraph","inlineContent":[{"text":"Q: I need a website and I heard that Bootstrap  is better than WordPress for mobile. What are your thoughts?","type":"text"}]},{"type":"paragraph","inlineContent":[{"type":"text","text":"My Answer: It is difficult to give specific advice without knowing your process for building websites, so I’ll discuss the options in general terms which will either be helpful or lead to more questions that will be helpful :). I’m going to try to explain at a Sesame Street level – not because I think you’re at that level but because I think it helps to get rid of assumptions that could get in the way of understanding."}]},{"type":"paragraph","inlineContent":[{"text":"To start, Wordpress and Bootstrap are two very different things.","type":"text"}]},{"inlineContent":[{"text":"Wordpress is a Content Management System (CMS) which is a fancy term for a system for storing content and sharing it with others. Content is text, images, videos, and everything else that you might want on a website.","type":"text"}],"type":"paragraph"},{"type":"paragraph","inlineContent":[{"type":"text","text":"Bootstrap is a “Mobile First Front-end Framework” which is a fancy term for a template of styles that are primarily meant to be used for websites being displayed mobile devices. Bootstrap also adapts the styles so that websites look right on desktop computers. Bootstrap is used in a similar way to a Wordpress theme – to change the way the website looks."}]},{"inlineContent":[{"text":"Everything Bootstrap or a Wordpress theme does can be done manually if you speak the right language. That language is Cascading Style Sheets (CSS) which is the fancy term used for the format of files used to change the styling of websites. Both Bootstrap and Wordpress themes are collections of CSS files that make the website look right on different screen sizes so the person making the site doesn’t have to do all the work themselves.","type":"text"}],"type":"paragraph"},{"inlineContent":[{"type":"text","text":"So Bootstrap cannot replace Wordpress because it doesn’t do everything Wordpress does. But it can be used with Wordpress, depending on your Wordpress skills. Some Wordpress themes use Bootstrap already."}],"type":"paragraph"},{"inlineContent":[{"type":"text","text":"The end result you want, whether using a Wordpress theme, Bootstrap, or manually creating CSS, is for the website to look good and be easily usable on all devices. This generally means large pictures are made smaller and multiple columns are made into one column on mobile. This will require looking at the site on different devices no matter what, but either a Wordpress theme or Bootstrap can do a lot of the work for you."}],"type":"paragraph"}]}],"identifier":{"interfaceLanguage":"swift","url":"doc:\/\/Brunow\/documentation\/Brunow\/08-27-wordpress-vs-bootstrap"},"abstract":[{"type":"text","text":"date: 2015-08-27T22:27:19-05:00"}],"metadata":{"color":{"standardColorIdentifier":"purple"},"title":"Wordpress vs Bootstrap","modules":[{"name":"Brunow"}],"platforms":[{"name":"Brunow","introducedAt":"2017.01.20"}]},"hierarchy":{"paths":[["doc:\/\/Brunow\/documentation\/Brunow","doc:\/\/Brunow\/documentation\/Brunow\/Archive","doc:\/\/Brunow\/documentation\/Brunow\/2015"]]},"references":{"doc://Brunow/documentation/Brunow/Archive":{"kind":"article","type":"topic","title":"Archive","abstract":[{"text":"All posts","type":"text"}],"identifier":"doc:\/\/Brunow\/documentation\/Brunow\/Archive","role":"collectionGroup","url":"\/documentation\/brunow\/archive"},"doc://Brunow/documentation/Brunow":{"type":"topic","title":"Brunow","url":"\/documentation\/brunow","identifier":"doc:\/\/Brunow\/documentation\/Brunow","kind":"symbol","abstract":[{"text":"David Brunow, known as Brunow [ˈbɹunoʊ] to the folks he works with, is a human living on Earth. You might have something in common with him — if you think it is ridiculous that he is talking about himself in the first person here, so does he.","type":"text"}],"role":"collection"},"doc://Brunow/documentation/Brunow/2015":{"type":"topic","title":"2015","url":"\/documentation\/brunow\/2015","identifier":"doc:\/\/Brunow\/documentation\/Brunow\/2015","kind":"article","abstract":[],"role":"collectionGroup"}}}