{"primaryContentSections":[{"kind":"content","content":[{"type":"paragraph","inlineContent":[{"type":"text","text":"A couple days ago I wrote about learning from how other industries have solved problems in the past that yours is facing today. When I wrote that I had one specific example in mind — the software industry learning from the book publishing industry."}]},{"type":"paragraph","inlineContent":[{"type":"text","text":"I’m certain I’m not the first to make a connection between these two businesses because what we do when creating apps is very similar to what authors do when they write books. We each take a bunch of different ideas and concepts and form them together into what we hope is a unified whole. Many times we fail at this, as authors do, and what we make feels like a jumbled mess. The big difference between us and authors is that they can use all of their given language while we can only use the subset that is our programming language."}]},{"type":"paragraph","inlineContent":[{"type":"text","text":"Of course the book industry is in decline and may not be able to be saved in the way we know it. But some authors are still thriving in these conditions. Why? Because they’ve built an audience. They have devoted fans who want to see them do well."}]},{"type":"paragraph","inlineContent":[{"type":"text","text":"I think that’s how we need to sell software — by selling it to our audience of fans that want to see us do well."}]},{"type":"paragraph","inlineContent":[{"type":"text","text":"Hopefully I’ve convinced you that building an audience is the way to succeed. Now you’re wondering how to do that. I’ve got two examples from the software industry which is exactly a statistical sample but it’s a start towards putting information together. These two examples have some things in common and one big difference."}]},{"type":"paragraph","inlineContent":[{"type":"text","text":"The first example is Marco Arment. He created the hit app Instapaper. Instapaper is unique amongst apps in that it solved a real problem in a novel way that no one else was solving. The app was and still is really useful."}]},{"type":"paragraph","inlineContent":[{"type":"text","text":"Instapaper was Marco’s big break towards building an audience. From that point he continued building it by hosting a few different podcasts and irregularly blogging."}]},{"type":"paragraph","inlineContent":[{"type":"text","text":"The second example is David Smith. He is an iOS developer in Virginia and none of his apps are very well known. But he has built an audience slowly over time through his generosity in sharing what he knows and what he is experiencing through his podcasting and blogging."}]},{"type":"paragraph","inlineContent":[{"type":"text","text":"I can see two options for you to start building your audience:"}]},{"type":"orderedList","items":[{"content":[{"type":"paragraph","inlineContent":[{"type":"text","text":"Make something so great and useful that people can’t ignore it"}]}]},{"content":[{"type":"paragraph","inlineContent":[{"type":"text","text":"Generously give your knowledge to as many people as possible through podcasting, blogging, or whatever other medium you can find"}]}]}]},{"type":"paragraph","inlineContent":[{"type":"text","text":"Either way, people won’t know they like you until they know you. Find ways to let people know you."}]}]}],"schemaVersion":{"major":0,"minor":3,"patch":0},"sections":[],"variants":[{"paths":["\/documentation\/brunow\/09-18-build-an-audience"],"traits":[{"interfaceLanguage":"swift"}]}],"topicSectionsStyle":"detailedGrid","identifier":{"url":"doc:\/\/Brunow\/documentation\/Brunow\/09-18-build-an-audience","interfaceLanguage":"swift"},"abstract":[{"type":"text","text":"date: 2015-09-18T22:02:12-05:00"}],"kind":"article","metadata":{"platforms":[{"name":"Brunow","introducedAt":"2017.01.20"}],"color":{"standardColorIdentifier":"purple"},"title":"Build An Audience","modules":[{"name":"Brunow"}]},"hierarchy":{"paths":[["doc:\/\/Brunow\/documentation\/Brunow","doc:\/\/Brunow\/documentation\/Brunow\/Archive","doc:\/\/Brunow\/documentation\/Brunow\/2015"]]},"references":{"doc://Brunow/documentation/Brunow/Archive":{"role":"collectionGroup","title":"Archive","abstract":[{"type":"text","text":"All posts"}],"identifier":"doc:\/\/Brunow\/documentation\/Brunow\/Archive","kind":"article","type":"topic","url":"\/documentation\/brunow\/archive"},"doc://Brunow/documentation/Brunow":{"role":"collection","title":"Brunow","abstract":[{"type":"text","text":"David Brunow, known as Brunow [ˈbɹunoʊ] to the folks he works with, is a human living on Earth. You might have something in common with him — if you think it is ridiculous that he is talking about himself in the first person here, so does he."}],"identifier":"doc:\/\/Brunow\/documentation\/Brunow","kind":"symbol","type":"topic","url":"\/documentation\/brunow"},"doc://Brunow/documentation/Brunow/2015":{"role":"collectionGroup","title":"2015","abstract":[],"identifier":"doc:\/\/Brunow\/documentation\/Brunow\/2015","kind":"article","type":"topic","url":"\/documentation\/brunow\/2015"}}}