{"variants":[{"traits":[{"interfaceLanguage":"swift"}],"paths":["\/documentation\/brunow\/10-25-the-user-experience-of-directing-traffic"]}],"identifier":{"url":"doc:\/\/Brunow\/documentation\/Brunow\/10-25-the-user-experience-of-directing-traffic","interfaceLanguage":"swift"},"topicSectionsStyle":"detailedGrid","hierarchy":{"paths":[["doc:\/\/Brunow\/documentation\/Brunow","doc:\/\/Brunow\/documentation\/Brunow\/Archive","doc:\/\/Brunow\/documentation\/Brunow\/2015"]]},"metadata":{"modules":[{"name":"Brunow"}],"platforms":[{"name":"Brunow","introducedAt":"2017.01.20"}],"title":"The User Experience Of Directing Traffic","color":{"standardColorIdentifier":"purple"}},"kind":"article","abstract":[{"type":"text","text":"date: 2015-10-25T21:43:39-05:00"}],"primaryContentSections":[{"content":[{"type":"paragraph","inlineContent":[{"text":"Yesterday I spent a few hours directing traffic from a single file line of cars, through a parking lot, and to one of three lines. I was working with a team of volunteers, high visibility vests, and a couple of walkie talkies. Our job was to spot what was written on a car’s windshield and based upon that direct them to the right place.","type":"text"}]},{"type":"paragraph","inlineContent":[{"type":"text","text":"Yesterday morning was gray and mostly rainy so we had to make adjustments — the water soluble markers for writing on the cars’ windshields wouldn’t work on the outside so they were put on the inside. Due to that constraint and the low amount of light from the gray skies, the writing on the windshields was difficult to read at any distance. We had to figure out a walkie talkie system on the fly to let our team members that were furthest away know what was coming towards them. But after only a few misdirected cars, we got the hang of that."}]},{"type":"paragraph","inlineContent":[{"type":"text","text":"The tougher problem for me was communicating with the drivers and I tried out several different strategies for showing them their destination. I tried pointing to the sign that they needed to drive towards which had letters of the alphabet that most likely weren’t their name. I think that didn’t work well because the signs were behind the a-pillars of their car. I tried telling them to follow the vehicle in front of them by providing its make and model. I tried pointing to members of the team that could direct them better. I tried lots of different ways to get them where they needed to be."}]},{"inlineContent":[{"text":"I was trying to think as though I were in the car with them and seeing what they saw but I wasn’t great at doing that some of the time. I found that it was easier to give too much information rather than too little — a person driving in a parking lot in the rain with people and trees all around are already overwhelmed. It doesn’t take too much more information to push them over the edge where they aren’t even listening to you.","type":"text"}],"type":"paragraph"},{"inlineContent":[{"type":"text","text":"My lesson from this is when trying to guide or teach someone you need to give them the right amount of information for them at that moment. If you’re going to get it wrong, which you probably will, then err on the side of giving less information to avoid overwhelming them. They can always ask for more."}],"type":"paragraph"}],"kind":"content"}],"sections":[],"schemaVersion":{"major":0,"minor":3,"patch":0},"references":{"doc://Brunow/documentation/Brunow":{"title":"Brunow","type":"topic","url":"\/documentation\/brunow","role":"collection","abstract":[{"type":"text","text":"David Brunow, known as Brunow [ˈbɹunoʊ] to the folks he works with, is a human living on Earth. You might have something in common with him — if you think it is ridiculous that he is talking about himself in the first person here, so does he."}],"identifier":"doc:\/\/Brunow\/documentation\/Brunow","kind":"symbol"},"doc://Brunow/documentation/Brunow/Archive":{"kind":"article","title":"Archive","identifier":"doc:\/\/Brunow\/documentation\/Brunow\/Archive","type":"topic","abstract":[{"text":"All posts","type":"text"}],"role":"collectionGroup","url":"\/documentation\/brunow\/archive"},"doc://Brunow/documentation/Brunow/2015":{"title":"2015","type":"topic","url":"\/documentation\/brunow\/2015","role":"collectionGroup","abstract":[],"identifier":"doc:\/\/Brunow\/documentation\/Brunow\/2015","kind":"article"}}}