{"topicSectionsStyle":"detailedGrid","sections":[],"variants":[{"traits":[{"interfaceLanguage":"swift"}],"paths":["\/documentation\/brunow\/11-16-a-different-approach"]}],"schemaVersion":{"major":0,"minor":3,"patch":0},"kind":"article","primaryContentSections":[{"content":[{"type":"paragraph","inlineContent":[{"text":"I remember when I first got into programming I approached some problems differently. I’m not sure the best way to describe it, but I think I attacked them like a human would rather than like a computer could. I’ll give an example.","type":"text"}]},{"type":"paragraph","inlineContent":[{"text":"A common problem I’ve come across is tracking time. Let’s say I make an application that tracks how long I’ve been working on a particular task. If I try to solve this problem like a human could, I’d try to count the number of seconds I’ve been doing something. Each time the clock ticks, I increment a variable that is tracking my total time. And really, this isn’t an unreasonable approach to the problem, even for a computer. But solving the problem like a computer can is much better.","type":"text"}]},{"type":"paragraph","inlineContent":[{"type":"text","text":"A computer can store abstract values that are difficult for the human mind to remember. And a computer can perform calculations on those values so much faster than I can blink that it boggles my mind if I let myself think about it. So a computer can use a different approach to solving this problem — it can store the starting time and the ending time and perform a calculation to find the total time. Why is this much better?"}]},{"type":"paragraph","inlineContent":[{"type":"text","text":"First, we have much richer information. Not only do we know the total time, but we know the start time and finish time. If we want to run a report and see how many hours are logged starting between 10 and 11 in the morning, we can. Since we can never predict how we may need to use information in the future, richer information is valuable."}]},{"type":"paragraph","inlineContent":[{"type":"text","text":"Second, the system is more reliable. If our program is counting and runs into a crashing bug then the count is lost. That is really bad if you’re trying to track billable time. If we save a start date and the program crashes, we still have that start date available when the program starts back up and we can continue where we left off."}]},{"inlineContent":[{"type":"text","text":"Third, the second approach is more efficient. If the computer constantly has to increment a number then it has to repeatedly work at regular intervals. That means it is using more power, and in the case of a mobile device draining the battery more quickly."}],"type":"paragraph"},{"inlineContent":[{"type":"text","text":"Since I’ve been doing programming for a while, the second approach is the only obvious one to me now. I have to work to try to remember how I approached the problem back when I was a beginner to see any other way to solve it."}],"type":"paragraph"}],"kind":"content"}],"identifier":{"url":"doc:\/\/Brunow\/documentation\/Brunow\/11-16-a-different-approach","interfaceLanguage":"swift"},"abstract":[{"type":"text","text":"date: 2015-11-16T23:18:24-06:00"}],"hierarchy":{"paths":[["doc:\/\/Brunow\/documentation\/Brunow","doc:\/\/Brunow\/documentation\/Brunow\/Archive","doc:\/\/Brunow\/documentation\/Brunow\/2015"]]},"metadata":{"platforms":[{"introducedAt":"2017.01.20","name":"Brunow"}],"color":{"standardColorIdentifier":"purple"},"modules":[{"name":"Brunow"}],"title":"A Different Approach"},"references":{"doc://Brunow/documentation/Brunow/Archive":{"kind":"article","type":"topic","title":"Archive","abstract":[{"text":"All posts","type":"text"}],"identifier":"doc:\/\/Brunow\/documentation\/Brunow\/Archive","role":"collectionGroup","url":"\/documentation\/brunow\/archive"},"doc://Brunow/documentation/Brunow/2015":{"type":"topic","title":"2015","url":"\/documentation\/brunow\/2015","identifier":"doc:\/\/Brunow\/documentation\/Brunow\/2015","kind":"article","abstract":[],"role":"collectionGroup"},"doc://Brunow/documentation/Brunow":{"type":"topic","title":"Brunow","url":"\/documentation\/brunow","identifier":"doc:\/\/Brunow\/documentation\/Brunow","kind":"symbol","abstract":[{"text":"David Brunow, known as Brunow [ˈbɹunoʊ] to the folks he works with, is a human living on Earth. You might have something in common with him — if you think it is ridiculous that he is talking about himself in the first person here, so does he.","type":"text"}],"role":"collection"}}}